zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
  __I  uint64_t PM1_T64N;                          /**< Port MAC 1 Transmit 64-Octet Packet Counter Register (etherStatsPkts64OctetsN), offset: 0x670, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_T127N;                         /**< Port MAC 1 Transmit 65 to 127-Octet Packet Counter Register (etherStatsPkts65to127OctetsN), offset: 0x678, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_T255N;                         /**< Port MAC 1 Transmit 128 to 255-Octet Packet Counter Register (etherStatsPkts128to255OctetsN), offset: 0x680, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_T511N;                         /**< Port MAC 1 Transmit 256 to 511-Octet Packet Counter Register (etherStatsPkts256to511OctetsN), offset: 0x688, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_T1023N;                        /**< Port MAC 1 Transmit 512 to 1023-Octet Packet Counter Register (etherStatsPkts512to1023OctetsN), offset: 0x690, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_T1522N;                        /**< Port MAC 1 Transmit 1024 to 1522-Octet Packet Counter Register (etherStatsPkts1024to1522OctetsN), offset: 0x698, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_T1523XN;                       /**< Port MAC 1 Transmit 1523 to TX_MTU-Octet Packet Counter Register (etherStatsPkts1523toMaxOctetsN), offset: 0x6A0, not available in all instances (available on 3 out of 5) */
  uint8_t RESERVED_31[24];
  __I  uint64_t PM1_TCNPN;                         /**< Port MAC 1 Transmit Control Packet Counter Register, offset: 0x6C0, not available in all instances (available on 3 out of 5) */
  uint8_t RESERVED_32[8];
  __I  uint64_t PM1_TDFRN;                         /**< Port MAC 1 Transmit Deferred Packet Counter Register(aFramesWithDeferredXmissions), offset: 0x6D0, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_TMCOLN;                        /**< Port MAC 1 Transmit Multiple Collisions Counter Register(aMultipleCollisionFrames), offset: 0x6D8, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_TSCOLN;                        /**< Port MAC 1 Transmit Single Collision Counter(aSingleCollisionFrames) Register, offset: 0x6E0, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_TLCOLN;                        /**< Port MAC 1 Transmit Late Collision Counter(aLateCollisions) Register, offset: 0x6E8, not available in all instances (available on 3 out of 5) */
  __I  uint64_t PM1_TECOLN;                        /**< Port MAC 1 Transmit Excessive Collisions Counter Register, offset: 0x6F0, not available in all instances (available on 3 out of 5) */
  uint8_t RESERVED_33[8];
  __IO uint32_t PM1_IF_MODE;                       /**< Port MAC 1 Interface Mode Control Register, offset: 0x700, not available in all instances (available on 3 out of 5) */
  uint8_t RESERVED_34[252];
  __IO uint32_t MAC_MERGE_MMCSR;                   /**< Port MAC Merge Control and Status Register, offset: 0x800, not available in all instances (available on 3 out of 5) */
  uint8_t RESERVED_35[4];
  __IO uint32_t MAC_MERGE_MMFAECR;                 /**< Port MAC Merge Frame Assembly Error Count Register, offset: 0x808, not available in all instances (available on 3 out of 5) */
  __IO uint32_t MAC_MERGE_MMFSECR;                 /**< Port MAC Merge Frame SMD Error Count Register, offset: 0x80C, not available in all instances (available on 3 out of 5) */
  __IO uint32_t MAC_MERGE_MMFAOCR;                 /**< Port MAC Merge Frame Assembly OK Count Register, offset: 0x810, not available in all instances (available on 3 out of 5) */
  __IO uint32_t MAC_MERGE_MMFCRXR;                 /**< Port MAC Merge Fragment Count RX Register, offset: 0x814, not available in all instances (available on 3 out of 5) */
  __IO uint32_t MAC_MERGE_MMFCTXR;                 /**< Port MAC Merge Fragment Count TX Register, offset: 0x818, not available in all instances (available on 3 out of 5) */
  __IO uint32_t MAC_MERGE_MMHCR;                   /**< Port MAC Merge Hold Count Register, offset: 0x81C, not available in all instances (available on 3 out of 5) */
  uint8_t RESERVED_36[992];
  __IO uint32_t PEMDIOCR;                          /**< Port external MDIO configuration register, offset: 0xC00 */
  __IO uint32_t PEMDIOICR;                         /**< Port external MDIO interface control register, offset: 0xC04 */
  __IO uint32_t PEMDIOIDR;                         /**< Port external MDIO interface data register, offset: 0xC08 */
  __IO uint32_t PEMDIORAR;                         /**< Port external MDIO register address register, offset: 0xC0C */
  __I  uint32_t PEMDIOSR;                          /**< Port external MDIO status register, offset: 0xC10 */
  uint8_t RESERVED_37[12];
  __IO uint32_t PPSCR;                             /**< PHY status configuration register, offset: 0xC20 */
  __IO uint32_t PPSCTRLR;                          /**< Port PHY status control register, offset: 0xC24 */
  __I  uint32_t PPSDR;                             /**< Port PHY status data register, offset: 0xC28 */
  __IO uint32_t PPSRAR;                            /**< Port PHY status register address register, offset: 0xC2C */
  __IO uint32_t PPSER;                             /**< Port PHY status event register, offset: 0xC30 */
  __IO uint32_t PPSMR;                             /**< Port PHY status mask register, offset: 0xC34 */
} NETC_ETH_LINK_Type, *NETC_ETH_LINK_MemMapPtr;

/** Number of instances of the NETC_ETH_LINK module. */
#define NETC_ETH_LINK_INSTANCE_COUNT             (5u)

/* NETC_ETH_LINK - Peripheral instance base addresses */
/** Peripheral NETC__SW0_ETH_MAC_PORT0 base address */
#define IP_NETC__SW0_ETH_MAC_PORT0_BASE          (0x6D005000u)
/** Peripheral NETC__SW0_ETH_MAC_PORT0 base pointer */
#define IP_NETC__SW0_ETH_MAC_PORT0               ((NETC_ETH_LINK_Type *)IP_NETC__SW0_ETH_MAC_PORT0_BASE)
/** Peripheral NETC__SW0_ETH_MAC_PORT1 base address */
#define IP_NETC__SW0_ETH_MAC_PORT1_BASE          (0x6D009000u)
/** Peripheral NETC__SW0_ETH_MAC_PORT1 base pointer */
#define IP_NETC__SW0_ETH_MAC_PORT1               ((NETC_ETH_LINK_Type *)IP_NETC__SW0_ETH_MAC_PORT1_BASE)
/** Peripheral NETC__SW0_ETH_MAC_PORT2 base address */
#define IP_NETC__SW0_ETH_MAC_PORT2_BASE          (0x6D00D000u)
/** Peripheral NETC__SW0_ETH_MAC_PORT2 base pointer */
#define IP_NETC__SW0_ETH_MAC_PORT2               ((NETC_ETH_LINK_Type *)IP_NETC__SW0_ETH_MAC_PORT2_BASE)
/** Peripheral NETC__SW0_ETH_MAC_PORT3 base address */
#define IP_NETC__SW0_ETH_MAC_PORT3_BASE          (0x6D011000u)
/** Peripheral NETC__SW0_ETH_MAC_PORT3 base pointer */
#define IP_NETC__SW0_ETH_MAC_PORT3               ((NETC_ETH_LINK_Type *)IP_NETC__SW0_ETH_MAC_PORT3_BASE)
/** Peripheral NETC__SW0_ETH_MAC_PORT4 base address */
#define IP_NETC__SW0_ETH_MAC_PORT4_BASE          (0x6D015000u)
/** Peripheral NETC__SW0_ETH_MAC_PORT4 base pointer */
#define IP_NETC__SW0_ETH_MAC_PORT4               ((NETC_ETH_LINK_Type *)IP_NETC__SW0_ETH_MAC_PORT4_BASE)
/** Array initializer of NETC_ETH_LINK peripheral base addresses */
#define IP_NETC_ETH_LINK_BASE_ADDRS              { IP_NETC__SW0_ETH_MAC_PORT0_BASE, IP_NETC__SW0_ETH_MAC_PORT1_BASE, IP_NETC__SW0_ETH_MAC_PORT2_BASE, IP_NETC__SW0_ETH_MAC_PORT3_BASE, IP_NETC__SW0_ETH_MAC_PORT4_BASE }
/** Array initializer of NETC_ETH_LINK peripheral base pointers */
#define IP_NETC_ETH_LINK_BASE_PTRS               { IP_NETC__SW0_ETH_MAC_PORT0, IP_NETC__SW0_ETH_MAC_PORT1, IP_NETC__SW0_ETH_MAC_PORT2, IP_NETC__SW0_ETH_MAC_PORT3, IP_NETC__SW0_ETH_MAC_PORT4 }

/* ----------------------------------------------------------------------------
   -- NETC_ETH_LINK Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_ETH_LINK_Register_Masks NETC_ETH_LINK Register Masks
 * @{
 */

/*! @name PM0_COMMAND_CONFIG - Port MAC 0 Command and Configuration Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_COMMAND_CONFIG_TX_EN_MASK (0x1U)
#define NETC_ETH_LINK_PM0_COMMAND_CONFIG_TX_EN_SHIFT (0U)
#define NETC_ETH_LINK_PM0_COMMAND_CONFIG_TX_EN_WIDTH (1U)
#define NETC_ETH_LINK_PM0_COMMAND_CONFIG_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_COMMAND_CONFIG_TX_EN_SHIFT)) & NETC_ETH_LINK_PM0_COMMAND_CONFIG_TX_EN_MASK)

