zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_MASK     (0x1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_WIDTH    (1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY2(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_BSY2_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_RD_ER_MASK (0x2U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_RD_ER_SHIFT (1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_RD_ER_WIDTH (1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_RD_ER(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_RD_ER_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_RD_ER_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_MASK (0x1CU)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_SHIFT (2U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_WIDTH (3U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_HOLD_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_MASK  (0x20U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_SHIFT (5U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_WIDTH (1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_PRE_DIS_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_MASK    (0x40U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_SHIFT   (6U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_WIDTH   (1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_ENC45(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_ENC45_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_MASK (0xFF80U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_SHIFT (7U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_WIDTH (9U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_MDIO_CLK_DIV_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_CIM_MASK      (0x20000000U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_CIM_SHIFT     (29U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_CIM_WIDTH     (1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_CIM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_CIM_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_CIM_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_CMP_MASK      (0x40000000U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_CMP_SHIFT     (30U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_CMP_WIDTH     (1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_CMP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_CMP_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_CMP_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_MASK     (0x80000000U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_SHIFT    (31U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_WIDTH    (1U)
#define NETC_ETH_LINK_PM0_MDIO_CFG_BSY1(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CFG_BSY1_MASK)
/*! @} */

/*! @name PM0_MDIO_CTL - Port MAC 0 Internal MDIO Interface Control Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_MASK (0x1FU)
#define NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_SHIFT (0U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_WIDTH (5U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CTL_DEV_ADDR_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_MASK (0x3E0U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_SHIFT (5U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_WIDTH (5U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CTL_PORT_ADDR_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CTL_READ_MASK     (0x8000U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_READ_SHIFT    (15U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_READ_WIDTH    (1U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_READ(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CTL_READ_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CTL_READ_MASK)

#define NETC_ETH_LINK_PM0_MDIO_CTL_BSY_MASK      (0x80000000U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_BSY_SHIFT     (31U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_BSY_WIDTH     (1U)
#define NETC_ETH_LINK_PM0_MDIO_CTL_BSY(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_CTL_BSY_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_CTL_BSY_MASK)
/*! @} */

/*! @name PM0_MDIO_DATA - Port MAC 0 Internal MDIO Interface Data Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_MASK (0xFFFFU)
#define NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_SHIFT (0U)
#define NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_WIDTH (16U)
#define NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_DATA_MDIO_DATA_MASK)

#define NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_MASK    (0x80000000U)
#define NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_SHIFT   (31U)
#define NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_WIDTH   (1U)
#define NETC_ETH_LINK_PM0_MDIO_DATA_BUSY(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_DATA_BUSY_MASK)
/*! @} */

/*! @name PM0_MDIO_ADDR - Port MAC 0 Internal MDIO Register Address Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_MDIO_ADDR_REGADDR_MASK (0xFFFFU)
#define NETC_ETH_LINK_PM0_MDIO_ADDR_REGADDR_SHIFT (0U)
#define NETC_ETH_LINK_PM0_MDIO_ADDR_REGADDR_WIDTH (16U)
#define NETC_ETH_LINK_PM0_MDIO_ADDR_REGADDR(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_MDIO_ADDR_REGADDR_SHIFT)) & NETC_ETH_LINK_PM0_MDIO_ADDR_REGADDR_MASK)
/*! @} */

/*! @name PM0_IEVENT - Port MAC 0 Interrupt Event Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_IEVENT_RX_LOWP_MASK    (0x10U)
#define NETC_ETH_LINK_PM0_IEVENT_RX_LOWP_SHIFT   (4U)
#define NETC_ETH_LINK_PM0_IEVENT_RX_LOWP_WIDTH   (1U)
#define NETC_ETH_LINK_PM0_IEVENT_RX_LOWP(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IEVENT_RX_LOWP_SHIFT)) & NETC_ETH_LINK_PM0_IEVENT_RX_LOWP_MASK)

#define NETC_ETH_LINK_PM0_IEVENT_TX_EMPTY_MASK   (0x20U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_EMPTY_SHIFT  (5U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_EMPTY_WIDTH  (1U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_EMPTY(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IEVENT_TX_EMPTY_SHIFT)) & NETC_ETH_LINK_PM0_IEVENT_TX_EMPTY_MASK)

#define NETC_ETH_LINK_PM0_IEVENT_RX_EMPTY_MASK   (0x40U)
#define NETC_ETH_LINK_PM0_IEVENT_RX_EMPTY_SHIFT  (6U)
#define NETC_ETH_LINK_PM0_IEVENT_RX_EMPTY_WIDTH  (1U)
#define NETC_ETH_LINK_PM0_IEVENT_RX_EMPTY(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IEVENT_RX_EMPTY_SHIFT)) & NETC_ETH_LINK_PM0_IEVENT_RX_EMPTY_MASK)

#define NETC_ETH_LINK_PM0_IEVENT_TX_LOWP_MASK    (0x300U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_LOWP_SHIFT   (8U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_LOWP_WIDTH   (2U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_LOWP(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IEVENT_TX_LOWP_SHIFT)) & NETC_ETH_LINK_PM0_IEVENT_TX_LOWP_MASK)

#define NETC_ETH_LINK_PM0_IEVENT_TX_OVFL_MASK    (0x400U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_OVFL_SHIFT   (10U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_OVFL_WIDTH   (1U)
#define NETC_ETH_LINK_PM0_IEVENT_TX_OVFL(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IEVENT_TX_OVFL_SHIFT)) & NETC_ETH_LINK_PM0_IEVENT_TX_OVFL_MASK)

