zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
/*! @name PM0_LPWAKE_TIMER - Port MAC 0 EEE Low Power Wakeup Timer Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_LPWAKE_TIMER_TW_SYS_TX_MASK (0xFFFFFFU)
#define NETC_ETH_LINK_PM0_LPWAKE_TIMER_TW_SYS_TX_SHIFT (0U)
#define NETC_ETH_LINK_PM0_LPWAKE_TIMER_TW_SYS_TX_WIDTH (24U)
#define NETC_ETH_LINK_PM0_LPWAKE_TIMER_TW_SYS_TX(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_LPWAKE_TIMER_TW_SYS_TX_SHIFT)) & NETC_ETH_LINK_PM0_LPWAKE_TIMER_TW_SYS_TX_MASK)
/*! @} */

/*! @name PM0_SLEEP_TIMER - Port MAC 0 Transmit EEE Low Power Timer Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_SLEEP_TIMER_SLEEPT_MASK (0xFFFFFFU)
#define NETC_ETH_LINK_PM0_SLEEP_TIMER_SLEEPT_SHIFT (0U)
#define NETC_ETH_LINK_PM0_SLEEP_TIMER_SLEEPT_WIDTH (24U)
#define NETC_ETH_LINK_PM0_SLEEP_TIMER_SLEEPT(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_SLEEP_TIMER_SLEEPT_SHIFT)) & NETC_ETH_LINK_PM0_SLEEP_TIMER_SLEEPT_MASK)
/*! @} */

/*! @name PM0_SINGLE_STEP - Port MAC 0 IEEE1588 Single-Step Control Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_SINGLE_STEP_CH_MASK    (0x40U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_CH_SHIFT   (6U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_CH_WIDTH   (1U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_CH(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_SINGLE_STEP_CH_SHIFT)) & NETC_ETH_LINK_PM0_SINGLE_STEP_CH_MASK)

#define NETC_ETH_LINK_PM0_SINGLE_STEP_OFFSET_MASK (0x7F80U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_OFFSET_SHIFT (7U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_OFFSET_WIDTH (8U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_OFFSET(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_SINGLE_STEP_OFFSET_SHIFT)) & NETC_ETH_LINK_PM0_SINGLE_STEP_OFFSET_MASK)

#define NETC_ETH_LINK_PM0_SINGLE_STEP_EN_MASK    (0x80000000U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_EN_SHIFT   (31U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_EN_WIDTH   (1U)
#define NETC_ETH_LINK_PM0_SINGLE_STEP_EN(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_SINGLE_STEP_EN_SHIFT)) & NETC_ETH_LINK_PM0_SINGLE_STEP_EN_MASK)
/*! @} */

/*! @name PM0_HD_BACKOFF_ENTROPY - Port MAC 0 half-duplex backoff entropy register */
/*! @{ */

#define NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_MASK (0x3FFU)
#define NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_SHIFT (0U)
#define NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_WIDTH (10U)
#define NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_SHIFT)) & NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_MASK)

#define NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_MASK (0x80000000U)
#define NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_SHIFT (31U)
#define NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_WIDTH (1U)
#define NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_SHIFT)) & NETC_ETH_LINK_PM0_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_MASK)
/*! @} */

/*! @name PM0_HD_FLOW_CTRL - Port MAC 0 Half-Duplex Flow Control Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_OFF_MIN_MASK (0xFFFU)
#define NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_OFF_MIN_SHIFT (0U)
#define NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_OFF_MIN_WIDTH (12U)
#define NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_OFF_MIN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_OFF_MIN_SHIFT)) & NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_OFF_MIN_MASK)

#define NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_ON_MAX_MASK (0xFFF0000U)
#define NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_ON_MAX_SHIFT (16U)
#define NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_ON_MAX_WIDTH (12U)
#define NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_ON_MAX(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_ON_MAX_SHIFT)) & NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_ON_MAX_MASK)
/*! @} */

/*! @name PM0_STATN_CONFIG - Port MAC 0 Statistics Configuration Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_STATN_CONFIG_SAT_MASK  (0x1U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_SAT_SHIFT (0U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_SAT_WIDTH (1U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_SAT(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_STATN_CONFIG_SAT_SHIFT)) & NETC_ETH_LINK_PM0_STATN_CONFIG_SAT_MASK)

#define NETC_ETH_LINK_PM0_STATN_CONFIG_COD_MASK  (0x2U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_COD_SHIFT (1U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_COD_WIDTH (1U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_COD(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_STATN_CONFIG_COD_SHIFT)) & NETC_ETH_LINK_PM0_STATN_CONFIG_COD_MASK)

#define NETC_ETH_LINK_PM0_STATN_CONFIG_CLR_MASK  (0x4U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_CLR_SHIFT (2U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_CLR_WIDTH (1U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_CLR(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_STATN_CONFIG_CLR_SHIFT)) & NETC_ETH_LINK_PM0_STATN_CONFIG_CLR_MASK)

#define NETC_ETH_LINK_PM0_STATN_CONFIG_WEN_MASK  (0x8U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_WEN_SHIFT (3U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_WEN_WIDTH (1U)
#define NETC_ETH_LINK_PM0_STATN_CONFIG_WEN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_STATN_CONFIG_WEN_SHIFT)) & NETC_ETH_LINK_PM0_STATN_CONFIG_WEN_MASK)
/*! @} */

/*! @name PM0_REOCTN - Port MAC 0 Receive Ethernet Octets Counter(etherStatsOctetsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_REOCTN_REOCTn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_REOCTN_REOCTn_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_REOCTN_REOCTn_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_REOCTN_REOCTn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_REOCTN_REOCTn_SHIFT)) & NETC_ETH_LINK_PM0_REOCTN_REOCTn_MASK)
/*! @} */

/*! @name PM0_ROCTN - Port MAC 0 Receive Octets Counter(iflnOctetsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_ROCTN_ROCTn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_ROCTN_ROCTn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_ROCTN_ROCTn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_ROCTN_ROCTn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_ROCTN_ROCTn_SHIFT)) & NETC_ETH_LINK_PM0_ROCTN_ROCTn_MASK)
/*! @} */

/*! @name PM0_RXPFN - Port MAC 0 Receive Valid Pause Frame Counter Register(aPAUSEMACCtrlFramesReceivedn) */
/*! @{ */

