zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM0_RXPFN_RXPFn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RXPFN_RXPFn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RXPFN_RXPFn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RXPFN_RXPFn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RXPFN_RXPFn_SHIFT)) & NETC_ETH_LINK_PM0_RXPFN_RXPFn_MASK)
/*! @} */

/*! @name PM0_RFRMN - Port MAC 0 Receive Frame Counter Register(aFramesReceivedOKn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RFRMN_RFRMn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RFRMN_RFRMn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RFRMN_RFRMn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RFRMN_RFRMn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RFRMN_RFRMn_SHIFT)) & NETC_ETH_LINK_PM0_RFRMN_RFRMn_MASK)
/*! @} */

/*! @name PM0_RFCSN - Port MAC 0 Receive Frame Check Sequence Error Counter Register() */
/*! @{ */

#define NETC_ETH_LINK_PM0_RFCSN_RFCSn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RFCSN_RFCSn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RFCSN_RFCSn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RFCSN_RFCSn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RFCSN_RFCSn_SHIFT)) & NETC_ETH_LINK_PM0_RFCSN_RFCSn_MASK)
/*! @} */

/*! @name PM0_RVLANN - Port MAC 0 Receive VLAN Frame Counter Register(VLANReceivedOKn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RVLANN_RVLANn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RVLANN_RVLANn_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_RVLANN_RVLANn_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_RVLANN_RVLANn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RVLANN_RVLANn_SHIFT)) & NETC_ETH_LINK_PM0_RVLANN_RVLANn_MASK)
/*! @} */

/*! @name PM0_RERRN - Port MAC 0 Receive Frame Error Counter Register(ifInErrorsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RERRN_RERRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RERRN_RERRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RERRN_RERRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RERRN_RERRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RERRN_RERRn_SHIFT)) & NETC_ETH_LINK_PM0_RERRN_RERRn_MASK)
/*! @} */

/*! @name PM0_RUCAN - Port MAC 0 Receive Unicast Frame Counter Register(ifInUcastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RUCAN_RUCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RUCAN_RUCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RUCAN_RUCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RUCAN_RUCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RUCAN_RUCAn_SHIFT)) & NETC_ETH_LINK_PM0_RUCAN_RUCAn_MASK)
/*! @} */

/*! @name PM0_RMCAN - Port MAC 0 Receive Multicast Frame Counter Register(ifInMulticastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RMCAN_RMCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RMCAN_RMCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RMCAN_RMCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RMCAN_RMCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RMCAN_RMCAn_SHIFT)) & NETC_ETH_LINK_PM0_RMCAN_RMCAn_MASK)
/*! @} */

/*! @name PM0_RBCAN - Port MAC 0 Receive Broadcast Frame Counter Register(ifInBroadcastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RBCAN_RBCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RBCAN_RBCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RBCAN_RBCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RBCAN_RBCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RBCAN_RBCAn_SHIFT)) & NETC_ETH_LINK_PM0_RBCAN_RBCAn_MASK)
/*! @} */

/*! @name PM0_RDRPN - Port MAC 0 Receive Dropped Packets Counter Register(etherStatsDropEventsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RDRPN_RDRPn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RDRPN_RDRPn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RDRPN_RDRPn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RDRPN_RDRPn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RDRPN_RDRPn_SHIFT)) & NETC_ETH_LINK_PM0_RDRPN_RDRPn_MASK)
/*! @} */

/*! @name PM0_RPKTN - Port MAC 0 Receive Packets Counter Register(etherStatsPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RPKTN_RPKTn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RPKTN_RPKTn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RPKTN_RPKTn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RPKTN_RPKTn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RPKTN_RPKTn_SHIFT)) & NETC_ETH_LINK_PM0_RPKTN_RPKTn_MASK)
/*! @} */

/*! @name PM0_RUNDN - Port MAC 0 Receive Undersized Packet Counter Register(etherStatsUndersizePktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RUNDN_RUNDn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RUNDN_RUNDn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RUNDN_RUNDn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RUNDN_RUNDn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RUNDN_RUNDn_SHIFT)) & NETC_ETH_LINK_PM0_RUNDN_RUNDn_MASK)
/*! @} */

/*! @name PM0_R64N - Port MAC 0 Receive 64-Octet Packet Counter Register(etherStatsPkts64OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_R64N_R64n_MASK         (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_R64N_R64n_SHIFT        (0U)
#define NETC_ETH_LINK_PM0_R64N_R64n_WIDTH        (64U)
#define NETC_ETH_LINK_PM0_R64N_R64n(x)           (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_R64N_R64n_SHIFT)) & NETC_ETH_LINK_PM0_R64N_R64n_MASK)
/*! @} */

/*! @name PM0_R127N - Port MAC 0 Receive 65 to 127-Octet Packet Counter Register(etherStatsPkts65to127OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_R127N_R127n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_R127N_R127n_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_R127N_R127n_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_R127N_R127n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_R127N_R127n_SHIFT)) & NETC_ETH_LINK_PM0_R127N_R127n_MASK)
/*! @} */

/*! @name PM0_R255N - Port MAC 0 Receive 128 to 255-Octet Packet Counter Register(etherStatsPkts128to255OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_R255N_R255n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_R255N_R255n_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_R255N_R255n_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_R255N_R255n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_R255N_R255n_SHIFT)) & NETC_ETH_LINK_PM0_R255N_R255n_MASK)
/*! @} */

