zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
/*! @name PM0_R511N - Port MAC 0 Receive 256 to 511-Octet Packet Counter Register(etherStatsPkts256to511OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_R511N_R511n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_R511N_R511n_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_R511N_R511n_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_R511N_R511n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_R511N_R511n_SHIFT)) & NETC_ETH_LINK_PM0_R511N_R511n_MASK)
/*! @} */

/*! @name PM0_R1023N - Port MAC 0 Receive 512 to 1023-Octet Packet Counter Register(etherStatsPkts512to1023OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_R1023N_R1023n_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_R1023N_R1023n_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_R1023N_R1023n_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_R1023N_R1023n(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_R1023N_R1023n_SHIFT)) & NETC_ETH_LINK_PM0_R1023N_R1023n_MASK)
/*! @} */

/*! @name PM0_R1522N - Port MAC 0 Receive 1024 to 1522-Octet Packet Counter Register(etherStatsPkts1024to1522OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_R1522N_R1522n_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_R1522N_R1522n_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_R1522N_R1522n_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_R1522N_R1522n(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_R1522N_R1522n_SHIFT)) & NETC_ETH_LINK_PM0_R1522N_R1522n_MASK)
/*! @} */

/*! @name PM0_R1523XN - Port MAC 0 Receive 1523 to Max-Octet Packet Counter Register(etherStatsPkts1523toMaxOctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_R1523XN_R1523Xn_MASK   (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_R1523XN_R1523Xn_SHIFT  (0U)
#define NETC_ETH_LINK_PM0_R1523XN_R1523Xn_WIDTH  (64U)
#define NETC_ETH_LINK_PM0_R1523XN_R1523Xn(x)     (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_R1523XN_R1523Xn_SHIFT)) & NETC_ETH_LINK_PM0_R1523XN_R1523Xn_MASK)
/*! @} */

/*! @name PM0_ROVRN - Port MAC 0 Receive Oversized Packet Counter Register(etherStatsOversizePktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_ROVRN_ROVRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_ROVRN_ROVRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_ROVRN_ROVRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_ROVRN_ROVRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_ROVRN_ROVRn_SHIFT)) & NETC_ETH_LINK_PM0_ROVRN_ROVRn_MASK)
/*! @} */

/*! @name PM0_RJBRN - Port MAC 0 Receive Jabber Packet Counter Register(etherStatsJabbersn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RJBRN_RJBRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RJBRN_RJBRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RJBRN_RJBRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RJBRN_RJBRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RJBRN_RJBRn_SHIFT)) & NETC_ETH_LINK_PM0_RJBRN_RJBRn_MASK)
/*! @} */

/*! @name PM0_RFRGN - Port MAC 0 Receive Fragment Packet Counter Register(etherStatsFragmentsn */
/*! @{ */

#define NETC_ETH_LINK_PM0_RFRGN_RFRGn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RFRGN_RFRGn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RFRGN_RFRGn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RFRGN_RFRGn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RFRGN_RFRGn_SHIFT)) & NETC_ETH_LINK_PM0_RFRGN_RFRGn_MASK)
/*! @} */

/*! @name PM0_RCNPN - Port MAC 0 Receive Control Packet Counter Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_RCNPN_RCNPn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RCNPN_RCNPn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_RCNPN_RCNPn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_RCNPN_RCNPn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RCNPN_RCNPn_SHIFT)) & NETC_ETH_LINK_PM0_RCNPN_RCNPn_MASK)
/*! @} */

/*! @name PM0_RDRNTPN - Port MAC 0 Receive Dropped Not Truncated Packets Counter Register(etherStatsDropEventsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_RDRNTPN_RDRNTPn_MASK   (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_RDRNTPN_RDRNTPn_SHIFT  (0U)
#define NETC_ETH_LINK_PM0_RDRNTPN_RDRNTPn_WIDTH  (64U)
#define NETC_ETH_LINK_PM0_RDRNTPN_RDRNTPn(x)     (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_RDRNTPN_RDRNTPn_SHIFT)) & NETC_ETH_LINK_PM0_RDRNTPN_RDRNTPn_MASK)
/*! @} */

/*! @name PM0_TEOCTN - Port MAC 0 Transmit Ethernet Octets Counter(etherStatsOctetsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TEOCTN_TEOCTn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TEOCTN_TEOCTn_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_TEOCTN_TEOCTn_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_TEOCTN_TEOCTn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TEOCTN_TEOCTn_SHIFT)) & NETC_ETH_LINK_PM0_TEOCTN_TEOCTn_MASK)
/*! @} */

/*! @name PM0_TOCTN - Port MAC 0 Transmit Octets Counter Register(ifOutOctetsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TOCTN_TOCTn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TOCTN_TOCTn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TOCTN_TOCTn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TOCTN_TOCTn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TOCTN_TOCTn_SHIFT)) & NETC_ETH_LINK_PM0_TOCTN_TOCTn_MASK)
/*! @} */

/*! @name PM0_TXPFN - Port MAC 0 Transmit Valid Pause Frame Counter Register(aPAUSEMACCtrlFramesReceivedn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TXPFN_TXPFn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TXPFN_TXPFn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TXPFN_TXPFn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TXPFN_TXPFn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TXPFN_TXPFn_SHIFT)) & NETC_ETH_LINK_PM0_TXPFN_TXPFn_MASK)
/*! @} */

/*! @name PM0_TFRMN - Port MAC 0 Transmit Frame Counter Register(aFramesTransmittedOKn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TFRMN_TFRMn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TFRMN_TFRMn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TFRMN_TFRMn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TFRMN_TFRMn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TFRMN_TFRMn_SHIFT)) & NETC_ETH_LINK_PM0_TFRMN_TFRMn_MASK)
/*! @} */

