zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
/*! @name PM0_TFCSN - Port MAC 0 Transmit Frame Check Sequence Error Counter Register() */
/*! @{ */

#define NETC_ETH_LINK_PM0_TFCSN_TFCSn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TFCSN_TFCSn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TFCSN_TFCSn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TFCSN_TFCSn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TFCSN_TFCSn_SHIFT)) & NETC_ETH_LINK_PM0_TFCSN_TFCSn_MASK)
/*! @} */

/*! @name PM0_TVLANN - Port MAC 0 Transmit VLAN Frame Counter Register(VLANTransmittedOKn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TVLANN_TVLANn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TVLANN_TVLANn_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_TVLANN_TVLANn_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_TVLANN_TVLANn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TVLANN_TVLANn_SHIFT)) & NETC_ETH_LINK_PM0_TVLANN_TVLANn_MASK)
/*! @} */

/*! @name PM0_TERRN - Port MAC 0 Transmit Frame Error Counter Register(ifOutErrorsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TERRN_TERRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TERRN_TERRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TERRN_TERRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TERRN_TERRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TERRN_TERRn_SHIFT)) & NETC_ETH_LINK_PM0_TERRN_TERRn_MASK)
/*! @} */

/*! @name PM0_TUCAN - Port MAC 0 Transmit Unicast Frame Counter Register(ifOutUcastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TUCAN_TUCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TUCAN_TUCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TUCAN_TUCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TUCAN_TUCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TUCAN_TUCAn_SHIFT)) & NETC_ETH_LINK_PM0_TUCAN_TUCAn_MASK)
/*! @} */

/*! @name PM0_TMCAN - Port MAC 0 Transmit Multicast Frame Counter Register(ifOutMulticastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TMCAN_TMCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TMCAN_TMCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TMCAN_TMCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TMCAN_TMCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TMCAN_TMCAn_SHIFT)) & NETC_ETH_LINK_PM0_TMCAN_TMCAn_MASK)
/*! @} */

/*! @name PM0_TBCAN - Port MAC 0 Transmit Broadcast Frame Counter Register(ifOutBroadcastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TBCAN_TBCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TBCAN_TBCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TBCAN_TBCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TBCAN_TBCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TBCAN_TBCAn_SHIFT)) & NETC_ETH_LINK_PM0_TBCAN_TBCAn_MASK)
/*! @} */

/*! @name PM0_TPKTN - Port MAC 0 Transmit Packets Counter Register(etherStatsPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TPKTN_TPKTn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TPKTN_TPKTn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TPKTN_TPKTn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TPKTN_TPKTn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TPKTN_TPKTn_SHIFT)) & NETC_ETH_LINK_PM0_TPKTN_TPKTn_MASK)
/*! @} */

/*! @name PM0_TUNDN - Port MAC 0 Transmit Undersized Packet Counter Register(etherStatsUndersizePktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TUNDN_TUNDn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TUNDN_TUNDn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TUNDN_TUNDn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TUNDN_TUNDn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TUNDN_TUNDn_SHIFT)) & NETC_ETH_LINK_PM0_TUNDN_TUNDn_MASK)
/*! @} */

/*! @name PM0_T64N - Port MAC 0 Transmit 64-Octet Packet Counter Register (etherStatsPkts64OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_T64N_T64n_MASK         (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_T64N_T64n_SHIFT        (0U)
#define NETC_ETH_LINK_PM0_T64N_T64n_WIDTH        (64U)
#define NETC_ETH_LINK_PM0_T64N_T64n(x)           (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_T64N_T64n_SHIFT)) & NETC_ETH_LINK_PM0_T64N_T64n_MASK)
/*! @} */

/*! @name PM0_T127N - Port MAC 0 Transmit 65 to 127-Octet Packet Counter Register (etherStatsPkts65to127OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_T127N_T127n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_T127N_T127n_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_T127N_T127n_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_T127N_T127n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_T127N_T127n_SHIFT)) & NETC_ETH_LINK_PM0_T127N_T127n_MASK)
/*! @} */

/*! @name PM0_T255N - Port MAC 0 Transmit 128 to 255-Octet Packet Counter Register (etherStatsPkts128to255OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_T255N_T255n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_T255N_T255n_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_T255N_T255n_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_T255N_T255n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_T255N_T255n_SHIFT)) & NETC_ETH_LINK_PM0_T255N_T255n_MASK)
/*! @} */

/*! @name PM0_T511N - Port MAC 0 Transmit 256 to 511-Octet Packet Counter Register (etherStatsPkts256to511OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_T511N_T511n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_T511N_T511n_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_T511N_T511n_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_T511N_T511n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_T511N_T511n_SHIFT)) & NETC_ETH_LINK_PM0_T511N_T511n_MASK)
/*! @} */

/*! @name PM0_T1023N - Port MAC 0 Transmit 512 to 1023-Octet Packet Counter Register (etherStatsPkts512to1023OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_T1023N_T1023n_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_T1023N_T1023n_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_T1023N_T1023n_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_T1023N_T1023n(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_T1023N_T1023n_SHIFT)) & NETC_ETH_LINK_PM0_T1023N_T1023n_MASK)
/*! @} */

/*! @name PM0_T1522N - Port MAC 0 Transmit 1024 to 1522-Octet Packet Counter Register (etherStatsPkts1024to1522OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM0_T1522N_T1522n_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_T1522N_T1522n_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_T1522N_T1522n_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_T1522N_T1522n(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_T1522N_T1522n_SHIFT)) & NETC_ETH_LINK_PM0_T1522N_T1522n_MASK)
/*! @} */

/*! @name PM0_T1523XN - Port MAC 0 Transmit 1523 to TX_MTU-Octet Packet Counter Register (etherStatsPkts1523toMaxOctetsN) */
/*! @{ */

