zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM0_T1523XN_T1523Xn_MASK   (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_T1523XN_T1523Xn_SHIFT  (0U)
#define NETC_ETH_LINK_PM0_T1523XN_T1523Xn_WIDTH  (64U)
#define NETC_ETH_LINK_PM0_T1523XN_T1523Xn(x)     (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_T1523XN_T1523Xn_SHIFT)) & NETC_ETH_LINK_PM0_T1523XN_T1523Xn_MASK)
/*! @} */

/*! @name PM0_TCNPN - Port MAC 0 Transmit Control Packet Counter Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_TCNPN_TCNPn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TCNPN_TCNPn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TCNPN_TCNPn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TCNPN_TCNPn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TCNPN_TCNPn_SHIFT)) & NETC_ETH_LINK_PM0_TCNPN_TCNPn_MASK)
/*! @} */

/*! @name PM0_TDFRN - Port MAC 0 Transmit Deferred Packet Counter Register(aFramesWithDeferredXmissions) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TDFRN_TDFRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TDFRN_TDFRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM0_TDFRN_TDFRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM0_TDFRN_TDFRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TDFRN_TDFRn_SHIFT)) & NETC_ETH_LINK_PM0_TDFRN_TDFRn_MASK)
/*! @} */

/*! @name PM0_TMCOLN - Port MAC 0 Transmit Multiple Collisions Counter Register(aMultipleCollisionFrames) */
/*! @{ */

#define NETC_ETH_LINK_PM0_TMCOLN_TMCOLn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TMCOLN_TMCOLn_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_TMCOLN_TMCOLn_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_TMCOLN_TMCOLn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TMCOLN_TMCOLn_SHIFT)) & NETC_ETH_LINK_PM0_TMCOLN_TMCOLn_MASK)
/*! @} */

/*! @name PM0_TSCOLN - Port MAC 0 Transmit Single Collision Counter(aSingleCollisionFrames) Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_TSCOLN_TSCOLn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TSCOLN_TSCOLn_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_TSCOLN_TSCOLn_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_TSCOLN_TSCOLn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TSCOLN_TSCOLn_SHIFT)) & NETC_ETH_LINK_PM0_TSCOLN_TSCOLn_MASK)
/*! @} */

/*! @name PM0_TLCOLN - Port MAC 0 Transmit Late Collision Counter(aLateCollisions) Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_TLCOLN_TLCOLn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TLCOLN_TLCOLn_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_TLCOLN_TLCOLn_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_TLCOLN_TLCOLn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TLCOLN_TLCOLn_SHIFT)) & NETC_ETH_LINK_PM0_TLCOLN_TLCOLn_MASK)
/*! @} */

/*! @name PM0_TECOLN - Port MAC 0 Transmit Excessive Collisions Counter Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_TECOLN_TECOLn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM0_TECOLN_TECOLn_SHIFT    (0U)
#define NETC_ETH_LINK_PM0_TECOLN_TECOLn_WIDTH    (64U)
#define NETC_ETH_LINK_PM0_TECOLN_TECOLn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM0_TECOLN_TECOLn_SHIFT)) & NETC_ETH_LINK_PM0_TECOLN_TECOLn_MASK)
/*! @} */

/*! @name PM0_IF_MODE - Port MAC 0 Interface Mode Control Register */
/*! @{ */

#define NETC_ETH_LINK_PM0_IF_MODE_IFMODE_MASK    (0x7U)
#define NETC_ETH_LINK_PM0_IF_MODE_IFMODE_SHIFT   (0U)
#define NETC_ETH_LINK_PM0_IF_MODE_IFMODE_WIDTH   (3U)
#define NETC_ETH_LINK_PM0_IF_MODE_IFMODE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IF_MODE_IFMODE_SHIFT)) & NETC_ETH_LINK_PM0_IF_MODE_IFMODE_MASK)

#define NETC_ETH_LINK_PM0_IF_MODE_REVMII_MASK    (0x8U)
#define NETC_ETH_LINK_PM0_IF_MODE_REVMII_SHIFT   (3U)
#define NETC_ETH_LINK_PM0_IF_MODE_REVMII_WIDTH   (1U)
#define NETC_ETH_LINK_PM0_IF_MODE_REVMII(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IF_MODE_REVMII_SHIFT)) & NETC_ETH_LINK_PM0_IF_MODE_REVMII_MASK)

#define NETC_ETH_LINK_PM0_IF_MODE_M10_MASK       (0x10U)
#define NETC_ETH_LINK_PM0_IF_MODE_M10_SHIFT      (4U)
#define NETC_ETH_LINK_PM0_IF_MODE_M10_WIDTH      (1U)
#define NETC_ETH_LINK_PM0_IF_MODE_M10(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IF_MODE_M10_SHIFT)) & NETC_ETH_LINK_PM0_IF_MODE_M10_MASK)

#define NETC_ETH_LINK_PM0_IF_MODE_HD_MASK        (0x40U)
#define NETC_ETH_LINK_PM0_IF_MODE_HD_SHIFT       (6U)
#define NETC_ETH_LINK_PM0_IF_MODE_HD_WIDTH       (1U)
#define NETC_ETH_LINK_PM0_IF_MODE_HD(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IF_MODE_HD_SHIFT)) & NETC_ETH_LINK_PM0_IF_MODE_HD_MASK)

#define NETC_ETH_LINK_PM0_IF_MODE_RGMII_DLY_MODE_MASK (0x200U)
#define NETC_ETH_LINK_PM0_IF_MODE_RGMII_DLY_MODE_SHIFT (9U)
#define NETC_ETH_LINK_PM0_IF_MODE_RGMII_DLY_MODE_WIDTH (1U)
#define NETC_ETH_LINK_PM0_IF_MODE_RGMII_DLY_MODE(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IF_MODE_RGMII_DLY_MODE_SHIFT)) & NETC_ETH_LINK_PM0_IF_MODE_RGMII_DLY_MODE_MASK)

#define NETC_ETH_LINK_PM0_IF_MODE_CLK_STOP_MASK  (0x1000U)
#define NETC_ETH_LINK_PM0_IF_MODE_CLK_STOP_SHIFT (12U)
#define NETC_ETH_LINK_PM0_IF_MODE_CLK_STOP_WIDTH (1U)
#define NETC_ETH_LINK_PM0_IF_MODE_CLK_STOP(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IF_MODE_CLK_STOP_SHIFT)) & NETC_ETH_LINK_PM0_IF_MODE_CLK_STOP_MASK)

#define NETC_ETH_LINK_PM0_IF_MODE_SSP_MASK       (0x6000U)
#define NETC_ETH_LINK_PM0_IF_MODE_SSP_SHIFT      (13U)
#define NETC_ETH_LINK_PM0_IF_MODE_SSP_WIDTH      (2U)
#define NETC_ETH_LINK_PM0_IF_MODE_SSP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM0_IF_MODE_SSP_SHIFT)) & NETC_ETH_LINK_PM0_IF_MODE_SSP_MASK)
/*! @} */

/*! @name PM1_COMMAND_CONFIG - Port MAC 1 Command and Configuration Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_EN_MASK (0x1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_EN_SHIFT (0U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_EN_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_EN_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_EN_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_EN_MASK (0x2U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_EN_SHIFT (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_EN_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_EN_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_EN_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_FWD_MASK (0x80U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_FWD_SHIFT (7U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_FWD_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_FWD(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_FWD_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_FWD_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_IGN_MASK (0x100U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_IGN_SHIFT (8U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_IGN_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_IGN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_IGN_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_PAUSE_IGN_MASK)

