zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_LOOP_ENA_MASK (0x400U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_LOOP_ENA_SHIFT (10U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_LOOP_ENA_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_LOOP_ENA(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_LOOP_ENA_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_LOOP_ENA_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_LPBK_MODE_MASK (0x1800U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_LPBK_MODE_SHIFT (11U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_LPBK_MODE_WIDTH (2U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_LPBK_MODE(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_LPBK_MODE_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_LPBK_MODE_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_CNT_FRM_EN_MASK (0x2000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_CNT_FRM_EN_SHIFT (13U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_CNT_FRM_EN_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_CNT_FRM_EN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_CNT_FRM_EN_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_CNT_FRM_EN_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_PNT_MASK (0x4000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_PNT_SHIFT (14U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_PNT_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_PNT(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_PNT_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_PNT_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TXP_MASK (0x8000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TXP_SHIFT (15U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TXP_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TXP(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_TXP_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_TXP_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_HD_FCEN_MASK (0x40000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_HD_FCEN_SHIFT (18U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_HD_FCEN_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_HD_FCEN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_HD_FCEN_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_HD_FCEN_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_FLUSH_MASK (0x400000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_FLUSH_SHIFT (22U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_FLUSH_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_FLUSH(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_FLUSH_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_FLUSH_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_LOWP_ENA_MASK (0x800000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_LOWP_ENA_SHIFT (23U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_LOWP_ENA_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_LOWP_ENA(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_LOWP_ENA_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_TX_LOWP_ENA_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_REG_LOWP_RXETY_MASK (0x1000000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_REG_LOWP_RXETY_SHIFT (24U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_REG_LOWP_RXETY_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_REG_LOWP_RXETY(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_REG_LOWP_RXETY_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_REG_LOWP_RXETY_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_SWR_MASK (0x4000000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_SWR_SHIFT (26U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_SWR_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_SWR(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_SWR_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_SWR_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_FLUSH_MASK (0x10000000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_FLUSH_SHIFT (28U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_FLUSH_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_FLUSH(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_FLUSH_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_RX_FLUSH_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_MODE_MASK (0x40000000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_MODE_SHIFT (30U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_MODE_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_MODE(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_MODE_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_TS_MODE_MASK)

#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_MG_MASK (0x80000000U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_MG_SHIFT (31U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_MG_WIDTH (1U)
#define NETC_ETH_LINK_PM1_COMMAND_CONFIG_MG(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_COMMAND_CONFIG_MG_SHIFT)) & NETC_ETH_LINK_PM1_COMMAND_CONFIG_MG_MASK)
/*! @} */

/*! @name PM1_MAC_ADDR_0 - Port MAC 1 MAC Address Register 0 */
/*! @{ */

#define NETC_ETH_LINK_PM1_MAC_ADDR_0_MAC_ADDR_0_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_PM1_MAC_ADDR_0_MAC_ADDR_0_SHIFT (0U)
#define NETC_ETH_LINK_PM1_MAC_ADDR_0_MAC_ADDR_0_WIDTH (32U)
#define NETC_ETH_LINK_PM1_MAC_ADDR_0_MAC_ADDR_0(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_MAC_ADDR_0_MAC_ADDR_0_SHIFT)) & NETC_ETH_LINK_PM1_MAC_ADDR_0_MAC_ADDR_0_MASK)
/*! @} */

/*! @name PM1_MAC_ADDR_1 - Port MAC 1 MAC Address Register 1 */
/*! @{ */

#define NETC_ETH_LINK_PM1_MAC_ADDR_1_MAC_ADDR_1_MASK (0xFFFFU)
#define NETC_ETH_LINK_PM1_MAC_ADDR_1_MAC_ADDR_1_SHIFT (0U)
#define NETC_ETH_LINK_PM1_MAC_ADDR_1_MAC_ADDR_1_WIDTH (16U)
#define NETC_ETH_LINK_PM1_MAC_ADDR_1_MAC_ADDR_1(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_MAC_ADDR_1_MAC_ADDR_1_SHIFT)) & NETC_ETH_LINK_PM1_MAC_ADDR_1_MAC_ADDR_1_MASK)
/*! @} */

/*! @name PM1_MAXFRM - Port MAC 1 Maximum Frame Length Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_MAXFRM_MAXFRM_MASK     (0xFFFFU)
#define NETC_ETH_LINK_PM1_MAXFRM_MAXFRM_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_MAXFRM_MAXFRM_WIDTH    (16U)
#define NETC_ETH_LINK_PM1_MAXFRM_MAXFRM(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_MAXFRM_MAXFRM_SHIFT)) & NETC_ETH_LINK_PM1_MAXFRM_MAXFRM_MASK)

#define NETC_ETH_LINK_PM1_MAXFRM_TX_MTU_MASK     (0xFFFF0000U)
#define NETC_ETH_LINK_PM1_MAXFRM_TX_MTU_SHIFT    (16U)
#define NETC_ETH_LINK_PM1_MAXFRM_TX_MTU_WIDTH    (16U)
#define NETC_ETH_LINK_PM1_MAXFRM_TX_MTU(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_MAXFRM_TX_MTU_SHIFT)) & NETC_ETH_LINK_PM1_MAXFRM_TX_MTU_MASK)
/*! @} */

/*! @name PM1_IEVENT - Port MAC 1 Interrupt Event Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_MASK   (0x20U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_SHIFT  (5U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_WIDTH  (1U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_EMPTY_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_MASK   (0x40U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_SHIFT  (6U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_WIDTH  (1U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_RX_EMPTY_MASK)

