zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_IEVENT_TX_LOWP_MASK    (0x300U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_LOWP_SHIFT   (8U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_LOWP_WIDTH   (2U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_LOWP(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_LOWP_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_LOWP_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_MASK    (0x400U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_SHIFT   (10U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_OVFL(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_OVFL_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_MASK    (0x800U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_SHIFT   (11U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_UNFL(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_UNFL_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_MASK    (0x1000U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_SHIFT   (12U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_OVFL(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_RX_OVFL_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_MGI_MASK        (0x4000U)
#define NETC_ETH_LINK_PM1_IEVENT_MGI_SHIFT       (14U)
#define NETC_ETH_LINK_PM1_IEVENT_MGI_WIDTH       (1U)
#define NETC_ETH_LINK_PM1_IEVENT_MGI(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_MGI_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_MGI_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_TX_CSD_MASK     (0x200000U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_CSD_SHIFT    (21U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_CSD_WIDTH    (1U)
#define NETC_ETH_LINK_PM1_IEVENT_TX_CSD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_TX_CSD_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_TX_CSD_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_RX_CSD_MASK     (0x400000U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_CSD_SHIFT    (22U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_CSD_WIDTH    (1U)
#define NETC_ETH_LINK_PM1_IEVENT_RX_CSD(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_RX_CSD_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_RX_CSD_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_MASK    (0x800000U)
#define NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_SHIFT   (23U)
#define NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IEVENT_SPD_DUP(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_SPD_DUP_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_LINK_UP_MASK    (0x1000000U)
#define NETC_ETH_LINK_PM1_IEVENT_LINK_UP_SHIFT   (24U)
#define NETC_ETH_LINK_PM1_IEVENT_LINK_UP_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IEVENT_LINK_UP(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_LINK_UP_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_LINK_UP_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_LINK_DOWN_MASK  (0x2000000U)
#define NETC_ETH_LINK_PM1_IEVENT_LINK_DOWN_SHIFT (25U)
#define NETC_ETH_LINK_PM1_IEVENT_LINK_DOWN_WIDTH (1U)
#define NETC_ETH_LINK_PM1_IEVENT_LINK_DOWN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_LINK_DOWN_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_LINK_DOWN_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_AN_DONE_MASK    (0x4000000U)
#define NETC_ETH_LINK_PM1_IEVENT_AN_DONE_SHIFT   (26U)
#define NETC_ETH_LINK_PM1_IEVENT_AN_DONE_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IEVENT_AN_DONE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_AN_DONE_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_AN_DONE_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_MASK   (0x8000000U)
#define NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_SHIFT  (27U)
#define NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_WIDTH  (1U)
#define NETC_ETH_LINK_PM1_IEVENT_MRG_SERR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_MRG_SERR_MASK)

#define NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_MASK   (0x10000000U)
#define NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_SHIFT  (28U)
#define NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_WIDTH  (1U)
#define NETC_ETH_LINK_PM1_IEVENT_MRG_AERR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_SHIFT)) & NETC_ETH_LINK_PM1_IEVENT_MRG_AERR_MASK)
/*! @} */

/*! @name PM1_TX_IPG_PREAMBLE - Port MAC 1 Transmit Inter-Packet Gap Length and Flexible Preamble length Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_MASK (0x7FU)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_SHIFT (0U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_WIDTH (7U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_SHIFT)) & NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN_MASK)

#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_MASK (0x700U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_SHIFT (8U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_WIDTH (3U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_SHIFT)) & NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_MASK)

#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_MASK (0x80000000U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_SHIFT (31U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_WIDTH (1U)
#define NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_SHIFT)) & NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_MASK)
/*! @} */

/*! @name PM1_IMASK - Port MAC 1 Interrupt Mask Register(INT_MASK) */
/*! @{ */

#define NETC_ETH_LINK_PM1_IMASK_LI_FAULT_MASK    (0x80U)
#define NETC_ETH_LINK_PM1_IMASK_LI_FAULT_SHIFT   (7U)
#define NETC_ETH_LINK_PM1_IMASK_LI_FAULT_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IMASK_LI_FAULT(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_LI_FAULT_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_LI_FAULT_MASK)

