zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_IMASK_MGI_MASK         (0x4000U)
#define NETC_ETH_LINK_PM1_IMASK_MGI_SHIFT        (14U)
#define NETC_ETH_LINK_PM1_IMASK_MGI_WIDTH        (1U)
#define NETC_ETH_LINK_PM1_IMASK_MGI(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_MGI_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_MGI_MASK)

#define NETC_ETH_LINK_PM1_IMASK_TX_CSD_MASK      (0x200000U)
#define NETC_ETH_LINK_PM1_IMASK_TX_CSD_SHIFT     (21U)
#define NETC_ETH_LINK_PM1_IMASK_TX_CSD_WIDTH     (1U)
#define NETC_ETH_LINK_PM1_IMASK_TX_CSD(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_TX_CSD_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_TX_CSD_MASK)

#define NETC_ETH_LINK_PM1_IMASK_RX_CSD_MASK      (0x400000U)
#define NETC_ETH_LINK_PM1_IMASK_RX_CSD_SHIFT     (22U)
#define NETC_ETH_LINK_PM1_IMASK_RX_CSD_WIDTH     (1U)
#define NETC_ETH_LINK_PM1_IMASK_RX_CSD(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_RX_CSD_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_RX_CSD_MASK)

#define NETC_ETH_LINK_PM1_IMASK_SPD_DUP_MASK     (0x800000U)
#define NETC_ETH_LINK_PM1_IMASK_SPD_DUP_SHIFT    (23U)
#define NETC_ETH_LINK_PM1_IMASK_SPD_DUP_WIDTH    (1U)
#define NETC_ETH_LINK_PM1_IMASK_SPD_DUP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_SPD_DUP_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_SPD_DUP_MASK)

#define NETC_ETH_LINK_PM1_IMASK_LINK_UP_MASK     (0x1000000U)
#define NETC_ETH_LINK_PM1_IMASK_LINK_UP_SHIFT    (24U)
#define NETC_ETH_LINK_PM1_IMASK_LINK_UP_WIDTH    (1U)
#define NETC_ETH_LINK_PM1_IMASK_LINK_UP(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_LINK_UP_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_LINK_UP_MASK)

#define NETC_ETH_LINK_PM1_IMASK_LINK_DOWN_MASK   (0x2000000U)
#define NETC_ETH_LINK_PM1_IMASK_LINK_DOWN_SHIFT  (25U)
#define NETC_ETH_LINK_PM1_IMASK_LINK_DOWN_WIDTH  (1U)
#define NETC_ETH_LINK_PM1_IMASK_LINK_DOWN(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_LINK_DOWN_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_LINK_DOWN_MASK)

#define NETC_ETH_LINK_PM1_IMASK_AN_DONE_MASK     (0x4000000U)
#define NETC_ETH_LINK_PM1_IMASK_AN_DONE_SHIFT    (26U)
#define NETC_ETH_LINK_PM1_IMASK_AN_DONE_WIDTH    (1U)
#define NETC_ETH_LINK_PM1_IMASK_AN_DONE(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_AN_DONE_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_AN_DONE_MASK)

#define NETC_ETH_LINK_PM1_IMASK_MRG_SERR_MASK    (0x8000000U)
#define NETC_ETH_LINK_PM1_IMASK_MRG_SERR_SHIFT   (27U)
#define NETC_ETH_LINK_PM1_IMASK_MRG_SERR_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IMASK_MRG_SERR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_MRG_SERR_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_MRG_SERR_MASK)

#define NETC_ETH_LINK_PM1_IMASK_MRG_AERR_MASK    (0x10000000U)
#define NETC_ETH_LINK_PM1_IMASK_MRG_AERR_SHIFT   (28U)
#define NETC_ETH_LINK_PM1_IMASK_MRG_AERR_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IMASK_MRG_AERR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IMASK_MRG_AERR_SHIFT)) & NETC_ETH_LINK_PM1_IMASK_MRG_AERR_MASK)
/*! @} */

/*! @name PM1_PAUSE_QUANTA - Port MAC 1 Pause Quanta Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_PAUSE_QUANTA_PQNT_MASK (0xFFFFU)
#define NETC_ETH_LINK_PM1_PAUSE_QUANTA_PQNT_SHIFT (0U)
#define NETC_ETH_LINK_PM1_PAUSE_QUANTA_PQNT_WIDTH (16U)
#define NETC_ETH_LINK_PM1_PAUSE_QUANTA_PQNT(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_PAUSE_QUANTA_PQNT_SHIFT)) & NETC_ETH_LINK_PM1_PAUSE_QUANTA_PQNT_MASK)
/*! @} */

/*! @name PM1_PAUSE_THRESH - Port MAC 1 Pause Quanta Threshold Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_PAUSE_THRESH_QTH_MASK  (0xFFFFU)
#define NETC_ETH_LINK_PM1_PAUSE_THRESH_QTH_SHIFT (0U)
#define NETC_ETH_LINK_PM1_PAUSE_THRESH_QTH_WIDTH (16U)
#define NETC_ETH_LINK_PM1_PAUSE_THRESH_QTH(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_PAUSE_THRESH_QTH_SHIFT)) & NETC_ETH_LINK_PM1_PAUSE_THRESH_QTH_MASK)
/*! @} */

/*! @name PM1_RX_PAUSE_STATUS - Port MAC 1 Receive Pause Status Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_RX_PAUSE_STATUS_PSTAT_MASK (0x1U)
#define NETC_ETH_LINK_PM1_RX_PAUSE_STATUS_PSTAT_SHIFT (0U)
#define NETC_ETH_LINK_PM1_RX_PAUSE_STATUS_PSTAT_WIDTH (1U)
#define NETC_ETH_LINK_PM1_RX_PAUSE_STATUS_PSTAT(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_RX_PAUSE_STATUS_PSTAT_SHIFT)) & NETC_ETH_LINK_PM1_RX_PAUSE_STATUS_PSTAT_MASK)
/*! @} */

/*! @name PM1_LPWAKE_TIMER - Port MAC 1 EEE Low Power Wakeup Timer Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_LPWAKE_TIMER_TW_SYS_TX_MASK (0xFFFFFFU)
#define NETC_ETH_LINK_PM1_LPWAKE_TIMER_TW_SYS_TX_SHIFT (0U)
#define NETC_ETH_LINK_PM1_LPWAKE_TIMER_TW_SYS_TX_WIDTH (24U)
#define NETC_ETH_LINK_PM1_LPWAKE_TIMER_TW_SYS_TX(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_LPWAKE_TIMER_TW_SYS_TX_SHIFT)) & NETC_ETH_LINK_PM1_LPWAKE_TIMER_TW_SYS_TX_MASK)
/*! @} */

/*! @name PM1_SLEEP_TIMER - Port MAC 1 Transmit EEE Low Power Timer Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_SLEEP_TIMER_SLEEPT_MASK (0xFFFFFFU)
#define NETC_ETH_LINK_PM1_SLEEP_TIMER_SLEEPT_SHIFT (0U)
#define NETC_ETH_LINK_PM1_SLEEP_TIMER_SLEEPT_WIDTH (24U)
#define NETC_ETH_LINK_PM1_SLEEP_TIMER_SLEEPT(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_SLEEP_TIMER_SLEEPT_SHIFT)) & NETC_ETH_LINK_PM1_SLEEP_TIMER_SLEEPT_MASK)
/*! @} */

/*! @name PM1_SINGLE_STEP - Port MAC 1 IEEE1588 Single-Step Control Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_SINGLE_STEP_CH_MASK    (0x40U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_CH_SHIFT   (6U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_CH_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_CH(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_SINGLE_STEP_CH_SHIFT)) & NETC_ETH_LINK_PM1_SINGLE_STEP_CH_MASK)

#define NETC_ETH_LINK_PM1_SINGLE_STEP_OFFSET_MASK (0x7F80U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_OFFSET_SHIFT (7U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_OFFSET_WIDTH (8U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_OFFSET(x)  (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_SINGLE_STEP_OFFSET_SHIFT)) & NETC_ETH_LINK_PM1_SINGLE_STEP_OFFSET_MASK)

#define NETC_ETH_LINK_PM1_SINGLE_STEP_EN_MASK    (0x80000000U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_EN_SHIFT   (31U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_EN_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_SINGLE_STEP_EN(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_SINGLE_STEP_EN_SHIFT)) & NETC_ETH_LINK_PM1_SINGLE_STEP_EN_MASK)
/*! @} */

/*! @name PM1_HD_BACKOFF_ENTROPY - Port MAC 1 half-duplex backoff entropy register */
/*! @{ */

#define NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_MASK (0x3FFU)
#define NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_SHIFT (0U)
#define NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_WIDTH (10U)
#define NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_SHIFT)) & NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_HD_BACKOFF_ENTROPY_MASK)

#define NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_MASK (0x80000000U)
#define NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_SHIFT (31U)
#define NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_WIDTH (1U)
#define NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_SHIFT)) & NETC_ETH_LINK_PM1_HD_BACKOFF_ENTROPY_SW_ENTROPY_VALID_MASK)
/*! @} */

/*! @name PM1_HD_FLOW_CTRL - Port MAC 1 Half-Duplex Flow Control Register */
/*! @{ */

