zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_OFF_MIN_MASK (0xFFFU)
#define NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_OFF_MIN_SHIFT (0U)
#define NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_OFF_MIN_WIDTH (12U)
#define NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_OFF_MIN(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_OFF_MIN_SHIFT)) & NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_OFF_MIN_MASK)

#define NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_ON_MAX_MASK (0xFFF0000U)
#define NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_ON_MAX_SHIFT (16U)
#define NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_ON_MAX_WIDTH (12U)
#define NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_ON_MAX(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_ON_MAX_SHIFT)) & NETC_ETH_LINK_PM1_HD_FLOW_CTRL_HD_BP_ON_MAX_MASK)
/*! @} */

/*! @name PM1_STATN_CONFIG - Port MAC 1 Statistics Configuration Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_STATN_CONFIG_SAT_MASK  (0x1U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_SAT_SHIFT (0U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_SAT_WIDTH (1U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_SAT(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_STATN_CONFIG_SAT_SHIFT)) & NETC_ETH_LINK_PM1_STATN_CONFIG_SAT_MASK)

#define NETC_ETH_LINK_PM1_STATN_CONFIG_COD_MASK  (0x2U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_COD_SHIFT (1U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_COD_WIDTH (1U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_COD(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_STATN_CONFIG_COD_SHIFT)) & NETC_ETH_LINK_PM1_STATN_CONFIG_COD_MASK)

#define NETC_ETH_LINK_PM1_STATN_CONFIG_CLR_MASK  (0x4U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_CLR_SHIFT (2U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_CLR_WIDTH (1U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_CLR(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_STATN_CONFIG_CLR_SHIFT)) & NETC_ETH_LINK_PM1_STATN_CONFIG_CLR_MASK)

#define NETC_ETH_LINK_PM1_STATN_CONFIG_WEN_MASK  (0x8U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_WEN_SHIFT (3U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_WEN_WIDTH (1U)
#define NETC_ETH_LINK_PM1_STATN_CONFIG_WEN(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_STATN_CONFIG_WEN_SHIFT)) & NETC_ETH_LINK_PM1_STATN_CONFIG_WEN_MASK)
/*! @} */

/*! @name PM1_REOCTN - Port MAC 1 Receive Ethernet Octets Counter(etherStatsOctetsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_REOCTN_REOCTn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_REOCTN_REOCTn_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_REOCTN_REOCTn_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_REOCTN_REOCTn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_REOCTN_REOCTn_SHIFT)) & NETC_ETH_LINK_PM1_REOCTN_REOCTn_MASK)
/*! @} */

/*! @name PM1_ROCTN - Port MAC 1 Receive Octets Counter(iflnOctetsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_ROCTN_ROCTn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_ROCTN_ROCTn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_ROCTN_ROCTn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_ROCTN_ROCTn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_ROCTN_ROCTn_SHIFT)) & NETC_ETH_LINK_PM1_ROCTN_ROCTn_MASK)
/*! @} */

/*! @name PM1_RXPFN - Port MAC 1 Receive Valid Pause Frame Counter Register(aPAUSEMACCtrlFramesReceivedn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RXPFN_RXPFn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RXPFN_RXPFn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RXPFN_RXPFn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RXPFN_RXPFn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RXPFN_RXPFn_SHIFT)) & NETC_ETH_LINK_PM1_RXPFN_RXPFn_MASK)
/*! @} */

/*! @name PM1_RFRMN - Port MAC 1 Receive Frame Counter Register(aFramesReceivedOKn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RFRMN_RFRMn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RFRMN_RFRMn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RFRMN_RFRMn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RFRMN_RFRMn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RFRMN_RFRMn_SHIFT)) & NETC_ETH_LINK_PM1_RFRMN_RFRMn_MASK)
/*! @} */

/*! @name PM1_RFCSN - Port MAC 1 Receive Frame Check Sequence Error Counter Register() */
/*! @{ */

#define NETC_ETH_LINK_PM1_RFCSN_RFCSn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RFCSN_RFCSn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RFCSN_RFCSn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RFCSN_RFCSn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RFCSN_RFCSn_SHIFT)) & NETC_ETH_LINK_PM1_RFCSN_RFCSn_MASK)
/*! @} */

/*! @name PM1_RVLANN - Port MAC 1 Receive VLAN Frame Counter Register(VLANReceivedOKn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RVLANN_RVLANn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RVLANN_RVLANn_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_RVLANN_RVLANn_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_RVLANN_RVLANn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RVLANN_RVLANn_SHIFT)) & NETC_ETH_LINK_PM1_RVLANN_RVLANn_MASK)
/*! @} */

/*! @name PM1_RERRN - Port MAC 1 Receive Frame Error Counter Register(ifInErrorsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RERRN_RERRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RERRN_RERRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RERRN_RERRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RERRN_RERRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RERRN_RERRn_SHIFT)) & NETC_ETH_LINK_PM1_RERRN_RERRn_MASK)
/*! @} */

/*! @name PM1_RUCAN - Port MAC 1 Receive Unicast Frame Counter Register(ifInUcastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RUCAN_RUCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RUCAN_RUCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RUCAN_RUCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RUCAN_RUCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RUCAN_RUCAn_SHIFT)) & NETC_ETH_LINK_PM1_RUCAN_RUCAn_MASK)
/*! @} */

/*! @name PM1_RMCAN - Port MAC 1 Receive Multicast Frame Counter Register(ifInMulticastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RMCAN_RMCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RMCAN_RMCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RMCAN_RMCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RMCAN_RMCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RMCAN_RMCAn_SHIFT)) & NETC_ETH_LINK_PM1_RMCAN_RMCAn_MASK)
/*! @} */

/*! @name PM1_RBCAN - Port MAC 1 Receive Broadcast Frame Counter Register(ifInBroadcastPktsn) */
/*! @{ */

