zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_RBCAN_RBCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RBCAN_RBCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RBCAN_RBCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RBCAN_RBCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RBCAN_RBCAn_SHIFT)) & NETC_ETH_LINK_PM1_RBCAN_RBCAn_MASK)
/*! @} */

/*! @name PM1_RDRPN - Port MAC 1 Receive Dropped Packets Counter Register(etherStatsDropEventsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RDRPN_RDRPn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RDRPN_RDRPn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RDRPN_RDRPn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RDRPN_RDRPn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RDRPN_RDRPn_SHIFT)) & NETC_ETH_LINK_PM1_RDRPN_RDRPn_MASK)
/*! @} */

/*! @name PM1_RPKTN - Port MAC 1 Receive Packets Counter Register(etherStatsPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RPKTN_RPKTn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RPKTN_RPKTn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RPKTN_RPKTn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RPKTN_RPKTn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RPKTN_RPKTn_SHIFT)) & NETC_ETH_LINK_PM1_RPKTN_RPKTn_MASK)
/*! @} */

/*! @name PM1_RUNDN - Port MAC 1 Receive Undersized Packet Counter Register(etherStatsUndersizePktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RUNDN_RUNDn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RUNDN_RUNDn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RUNDN_RUNDn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RUNDN_RUNDn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RUNDN_RUNDn_SHIFT)) & NETC_ETH_LINK_PM1_RUNDN_RUNDn_MASK)
/*! @} */

/*! @name PM1_R64N - Port MAC 1 Receive 64-Octet Packet Counter Register(etherStatsPkts64OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_R64N_R64n_MASK         (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_R64N_R64n_SHIFT        (0U)
#define NETC_ETH_LINK_PM1_R64N_R64n_WIDTH        (64U)
#define NETC_ETH_LINK_PM1_R64N_R64n(x)           (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_R64N_R64n_SHIFT)) & NETC_ETH_LINK_PM1_R64N_R64n_MASK)
/*! @} */

/*! @name PM1_R127N - Port MAC 1 Receive 65 to 127-Octet Packet Counter Register(etherStatsPkts65to127OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_R127N_R127n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_R127N_R127n_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_R127N_R127n_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_R127N_R127n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_R127N_R127n_SHIFT)) & NETC_ETH_LINK_PM1_R127N_R127n_MASK)
/*! @} */

/*! @name PM1_R255N - Port MAC 1 Receive 128 to 255-Octet Packet Counter Register(etherStatsPkts128to255OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_R255N_R255n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_R255N_R255n_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_R255N_R255n_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_R255N_R255n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_R255N_R255n_SHIFT)) & NETC_ETH_LINK_PM1_R255N_R255n_MASK)
/*! @} */

/*! @name PM1_R511N - Port MAC 1 Receive 256 to 511-Octet Packet Counter Register(etherStatsPkts256to511OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_R511N_R511n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_R511N_R511n_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_R511N_R511n_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_R511N_R511n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_R511N_R511n_SHIFT)) & NETC_ETH_LINK_PM1_R511N_R511n_MASK)
/*! @} */

/*! @name PM1_R1023N - Port MAC 1 Receive 512 to 1023-Octet Packet Counter Register(etherStatsPkts512to1023OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_R1023N_R1023n_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_R1023N_R1023n_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_R1023N_R1023n_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_R1023N_R1023n(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_R1023N_R1023n_SHIFT)) & NETC_ETH_LINK_PM1_R1023N_R1023n_MASK)
/*! @} */

/*! @name PM1_R1522N - Port MAC 1 Receive 1024 to 1522-Octet Packet Counter Register(etherStatsPkts1024to1522OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_R1522N_R1522n_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_R1522N_R1522n_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_R1522N_R1522n_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_R1522N_R1522n(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_R1522N_R1522n_SHIFT)) & NETC_ETH_LINK_PM1_R1522N_R1522n_MASK)
/*! @} */

/*! @name PM1_R1523XN - Port MAC 1 Receive 1523 to Max-Octet Packet Counter Register(etherStatsPkts1523toMaxOctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_R1523XN_R1523Xn_MASK   (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_R1523XN_R1523Xn_SHIFT  (0U)
#define NETC_ETH_LINK_PM1_R1523XN_R1523Xn_WIDTH  (64U)
#define NETC_ETH_LINK_PM1_R1523XN_R1523Xn(x)     (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_R1523XN_R1523Xn_SHIFT)) & NETC_ETH_LINK_PM1_R1523XN_R1523Xn_MASK)
/*! @} */

/*! @name PM1_ROVRN - Port MAC 1 Receive Oversized Packet Counter Register(etherStatsOversizePktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_ROVRN_ROVRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_ROVRN_ROVRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_ROVRN_ROVRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_ROVRN_ROVRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_ROVRN_ROVRn_SHIFT)) & NETC_ETH_LINK_PM1_ROVRN_ROVRn_MASK)
/*! @} */

/*! @name PM1_RJBRN - Port MAC 1 Receive Jabber Packet Counter Register(etherStatsJabbersn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RJBRN_RJBRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RJBRN_RJBRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RJBRN_RJBRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RJBRN_RJBRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RJBRN_RJBRn_SHIFT)) & NETC_ETH_LINK_PM1_RJBRN_RJBRn_MASK)
/*! @} */

/*! @name PM1_RFRGN - Port MAC 1 Receive Fragment Packet Counter Register(etherStatsFragmentsn */
/*! @{ */

#define NETC_ETH_LINK_PM1_RFRGN_RFRGn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RFRGN_RFRGn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RFRGN_RFRGn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RFRGN_RFRGn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RFRGN_RFRGn_SHIFT)) & NETC_ETH_LINK_PM1_RFRGN_RFRGn_MASK)
/*! @} */

/*! @name PM1_RCNPN - Port MAC 1 Receive Control Packet Counter Register */
/*! @{ */

