zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_RCNPN_RCNPn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RCNPN_RCNPn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_RCNPN_RCNPn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_RCNPN_RCNPn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RCNPN_RCNPn_SHIFT)) & NETC_ETH_LINK_PM1_RCNPN_RCNPn_MASK)
/*! @} */

/*! @name PM1_RDRNTPN - Port MAC 1 Receive Dropped Not Truncated Packets Counter Register(etherStatsDropEventsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_RDRNTPN_RDRNTPn_MASK   (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_RDRNTPN_RDRNTPn_SHIFT  (0U)
#define NETC_ETH_LINK_PM1_RDRNTPN_RDRNTPn_WIDTH  (64U)
#define NETC_ETH_LINK_PM1_RDRNTPN_RDRNTPn(x)     (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_RDRNTPN_RDRNTPn_SHIFT)) & NETC_ETH_LINK_PM1_RDRNTPN_RDRNTPn_MASK)
/*! @} */

/*! @name PM1_TEOCTN - Port MAC 1 Transmit Ethernet Octets Counter(etherStatsOctetsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TEOCTN_TEOCTn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TEOCTN_TEOCTn_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_TEOCTN_TEOCTn_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_TEOCTN_TEOCTn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TEOCTN_TEOCTn_SHIFT)) & NETC_ETH_LINK_PM1_TEOCTN_TEOCTn_MASK)
/*! @} */

/*! @name PM1_TOCTN - Port MAC 1 Transmit Octets Counter Register(ifOutOctetsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TOCTN_TOCTn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TOCTN_TOCTn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TOCTN_TOCTn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TOCTN_TOCTn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TOCTN_TOCTn_SHIFT)) & NETC_ETH_LINK_PM1_TOCTN_TOCTn_MASK)
/*! @} */

/*! @name PM1_TXPFN - Port MAC 1 Transmit Valid Pause Frame Counter Register(aPAUSEMACCtrlFramesReceivedn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TXPFN_TXPFn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TXPFN_TXPFn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TXPFN_TXPFn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TXPFN_TXPFn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TXPFN_TXPFn_SHIFT)) & NETC_ETH_LINK_PM1_TXPFN_TXPFn_MASK)
/*! @} */

/*! @name PM1_TFRMN - Port MAC 1 Transmit Frame Counter Register(aFramesTransmittedOKn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TFRMN_TFRMn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TFRMN_TFRMn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TFRMN_TFRMn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TFRMN_TFRMn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TFRMN_TFRMn_SHIFT)) & NETC_ETH_LINK_PM1_TFRMN_TFRMn_MASK)
/*! @} */

/*! @name PM1_TFCSN - Port MAC 1 Transmit Frame Check Sequence Error Counter Register() */
/*! @{ */

#define NETC_ETH_LINK_PM1_TFCSN_TFCSn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TFCSN_TFCSn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TFCSN_TFCSn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TFCSN_TFCSn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TFCSN_TFCSn_SHIFT)) & NETC_ETH_LINK_PM1_TFCSN_TFCSn_MASK)
/*! @} */

/*! @name PM1_TVLANN - Port MAC 1 Transmit VLAN Frame Counter Register(VLANTransmittedOKn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TVLANN_TVLANn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TVLANN_TVLANn_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_TVLANN_TVLANn_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_TVLANN_TVLANn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TVLANN_TVLANn_SHIFT)) & NETC_ETH_LINK_PM1_TVLANN_TVLANn_MASK)
/*! @} */

/*! @name PM1_TERRN - Port MAC 1 Transmit Frame Error Counter Register(ifOutErrorsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TERRN_TERRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TERRN_TERRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TERRN_TERRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TERRN_TERRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TERRN_TERRn_SHIFT)) & NETC_ETH_LINK_PM1_TERRN_TERRn_MASK)
/*! @} */

/*! @name PM1_TUCAN - Port MAC 1 Transmit Unicast Frame Counter Register(ifOutUcastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TUCAN_TUCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TUCAN_TUCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TUCAN_TUCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TUCAN_TUCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TUCAN_TUCAn_SHIFT)) & NETC_ETH_LINK_PM1_TUCAN_TUCAn_MASK)
/*! @} */

/*! @name PM1_TMCAN - Port MAC 1 Transmit Multicast Frame Counter Register(ifOutMulticastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TMCAN_TMCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TMCAN_TMCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TMCAN_TMCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TMCAN_TMCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TMCAN_TMCAn_SHIFT)) & NETC_ETH_LINK_PM1_TMCAN_TMCAn_MASK)
/*! @} */

/*! @name PM1_TBCAN - Port MAC 1 Transmit Broadcast Frame Counter Register(ifOutBroadcastPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TBCAN_TBCAn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TBCAN_TBCAn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TBCAN_TBCAn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TBCAN_TBCAn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TBCAN_TBCAn_SHIFT)) & NETC_ETH_LINK_PM1_TBCAN_TBCAn_MASK)
/*! @} */

/*! @name PM1_TPKTN - Port MAC 1 Transmit Packets Counter Register(etherStatsPktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TPKTN_TPKTn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TPKTN_TPKTn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TPKTN_TPKTn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TPKTN_TPKTn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TPKTN_TPKTn_SHIFT)) & NETC_ETH_LINK_PM1_TPKTN_TPKTn_MASK)
/*! @} */

/*! @name PM1_TUNDN - Port MAC 1 Transmit Undersized Packet Counter Register(etherStatsUndersizePktsn) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TUNDN_TUNDn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TUNDN_TUNDn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TUNDN_TUNDn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TUNDN_TUNDn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TUNDN_TUNDn_SHIFT)) & NETC_ETH_LINK_PM1_TUNDN_TUNDn_MASK)
/*! @} */

/*! @name PM1_T64N - Port MAC 1 Transmit 64-Octet Packet Counter Register (etherStatsPkts64OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_T64N_T64n_MASK         (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_T64N_T64n_SHIFT        (0U)
#define NETC_ETH_LINK_PM1_T64N_T64n_WIDTH        (64U)
#define NETC_ETH_LINK_PM1_T64N_T64n(x)           (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_T64N_T64n_SHIFT)) & NETC_ETH_LINK_PM1_T64N_T64n_MASK)
/*! @} */

/*! @name PM1_T127N - Port MAC 1 Transmit 65 to 127-Octet Packet Counter Register (etherStatsPkts65to127OctetsN) */
/*! @{ */

