zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_T127N_T127n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_T127N_T127n_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_T127N_T127n_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_T127N_T127n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_T127N_T127n_SHIFT)) & NETC_ETH_LINK_PM1_T127N_T127n_MASK)
/*! @} */

/*! @name PM1_T255N - Port MAC 1 Transmit 128 to 255-Octet Packet Counter Register (etherStatsPkts128to255OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_T255N_T255n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_T255N_T255n_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_T255N_T255n_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_T255N_T255n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_T255N_T255n_SHIFT)) & NETC_ETH_LINK_PM1_T255N_T255n_MASK)
/*! @} */

/*! @name PM1_T511N - Port MAC 1 Transmit 256 to 511-Octet Packet Counter Register (etherStatsPkts256to511OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_T511N_T511n_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_T511N_T511n_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_T511N_T511n_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_T511N_T511n(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_T511N_T511n_SHIFT)) & NETC_ETH_LINK_PM1_T511N_T511n_MASK)
/*! @} */

/*! @name PM1_T1023N - Port MAC 1 Transmit 512 to 1023-Octet Packet Counter Register (etherStatsPkts512to1023OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_T1023N_T1023n_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_T1023N_T1023n_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_T1023N_T1023n_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_T1023N_T1023n(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_T1023N_T1023n_SHIFT)) & NETC_ETH_LINK_PM1_T1023N_T1023n_MASK)
/*! @} */

/*! @name PM1_T1522N - Port MAC 1 Transmit 1024 to 1522-Octet Packet Counter Register (etherStatsPkts1024to1522OctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_T1522N_T1522n_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_T1522N_T1522n_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_T1522N_T1522n_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_T1522N_T1522n(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_T1522N_T1522n_SHIFT)) & NETC_ETH_LINK_PM1_T1522N_T1522n_MASK)
/*! @} */

/*! @name PM1_T1523XN - Port MAC 1 Transmit 1523 to TX_MTU-Octet Packet Counter Register (etherStatsPkts1523toMaxOctetsN) */
/*! @{ */

#define NETC_ETH_LINK_PM1_T1523XN_T1523Xn_MASK   (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_T1523XN_T1523Xn_SHIFT  (0U)
#define NETC_ETH_LINK_PM1_T1523XN_T1523Xn_WIDTH  (64U)
#define NETC_ETH_LINK_PM1_T1523XN_T1523Xn(x)     (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_T1523XN_T1523Xn_SHIFT)) & NETC_ETH_LINK_PM1_T1523XN_T1523Xn_MASK)
/*! @} */

/*! @name PM1_TCNPN - Port MAC 1 Transmit Control Packet Counter Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_TCNPN_TCNPn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TCNPN_TCNPn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TCNPN_TCNPn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TCNPN_TCNPn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TCNPN_TCNPn_SHIFT)) & NETC_ETH_LINK_PM1_TCNPN_TCNPn_MASK)
/*! @} */

/*! @name PM1_TDFRN - Port MAC 1 Transmit Deferred Packet Counter Register(aFramesWithDeferredXmissions) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TDFRN_TDFRn_MASK       (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TDFRN_TDFRn_SHIFT      (0U)
#define NETC_ETH_LINK_PM1_TDFRN_TDFRn_WIDTH      (64U)
#define NETC_ETH_LINK_PM1_TDFRN_TDFRn(x)         (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TDFRN_TDFRn_SHIFT)) & NETC_ETH_LINK_PM1_TDFRN_TDFRn_MASK)
/*! @} */

/*! @name PM1_TMCOLN - Port MAC 1 Transmit Multiple Collisions Counter Register(aMultipleCollisionFrames) */
/*! @{ */

#define NETC_ETH_LINK_PM1_TMCOLN_TMCOLn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TMCOLN_TMCOLn_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_TMCOLN_TMCOLn_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_TMCOLN_TMCOLn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TMCOLN_TMCOLn_SHIFT)) & NETC_ETH_LINK_PM1_TMCOLN_TMCOLn_MASK)
/*! @} */

/*! @name PM1_TSCOLN - Port MAC 1 Transmit Single Collision Counter(aSingleCollisionFrames) Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_TSCOLN_TSCOLn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TSCOLN_TSCOLn_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_TSCOLN_TSCOLn_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_TSCOLN_TSCOLn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TSCOLN_TSCOLn_SHIFT)) & NETC_ETH_LINK_PM1_TSCOLN_TSCOLn_MASK)
/*! @} */

/*! @name PM1_TLCOLN - Port MAC 1 Transmit Late Collision Counter(aLateCollisions) Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_TLCOLN_TLCOLn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TLCOLN_TLCOLn_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_TLCOLN_TLCOLn_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_TLCOLN_TLCOLn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TLCOLN_TLCOLn_SHIFT)) & NETC_ETH_LINK_PM1_TLCOLN_TLCOLn_MASK)
/*! @} */

/*! @name PM1_TECOLN - Port MAC 1 Transmit Excessive Collisions Counter Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_TECOLN_TECOLn_MASK     (0xFFFFFFFFFFFFFFFFU)
#define NETC_ETH_LINK_PM1_TECOLN_TECOLn_SHIFT    (0U)
#define NETC_ETH_LINK_PM1_TECOLN_TECOLn_WIDTH    (64U)
#define NETC_ETH_LINK_PM1_TECOLN_TECOLn(x)       (((uint64_t)(((uint64_t)(x)) << NETC_ETH_LINK_PM1_TECOLN_TECOLn_SHIFT)) & NETC_ETH_LINK_PM1_TECOLN_TECOLn_MASK)
/*! @} */

/*! @name PM1_IF_MODE - Port MAC 1 Interface Mode Control Register */
/*! @{ */

#define NETC_ETH_LINK_PM1_IF_MODE_IFMODE_MASK    (0x7U)
#define NETC_ETH_LINK_PM1_IF_MODE_IFMODE_SHIFT   (0U)
#define NETC_ETH_LINK_PM1_IF_MODE_IFMODE_WIDTH   (3U)
#define NETC_ETH_LINK_PM1_IF_MODE_IFMODE(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_IFMODE_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_IFMODE_MASK)

#define NETC_ETH_LINK_PM1_IF_MODE_REVMII_MASK    (0x8U)
#define NETC_ETH_LINK_PM1_IF_MODE_REVMII_SHIFT   (3U)
#define NETC_ETH_LINK_PM1_IF_MODE_REVMII_WIDTH   (1U)
#define NETC_ETH_LINK_PM1_IF_MODE_REVMII(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_REVMII_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_REVMII_MASK)

#define NETC_ETH_LINK_PM1_IF_MODE_M10_MASK       (0x10U)
#define NETC_ETH_LINK_PM1_IF_MODE_M10_SHIFT      (4U)
#define NETC_ETH_LINK_PM1_IF_MODE_M10_WIDTH      (1U)
#define NETC_ETH_LINK_PM1_IF_MODE_M10(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_M10_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_M10_MASK)

