zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PM1_IF_MODE_HD_MASK        (0x40U)
#define NETC_ETH_LINK_PM1_IF_MODE_HD_SHIFT       (6U)
#define NETC_ETH_LINK_PM1_IF_MODE_HD_WIDTH       (1U)
#define NETC_ETH_LINK_PM1_IF_MODE_HD(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_HD_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_HD_MASK)

#define NETC_ETH_LINK_PM1_IF_MODE_RGMII_DLY_MODE_MASK (0x200U)
#define NETC_ETH_LINK_PM1_IF_MODE_RGMII_DLY_MODE_SHIFT (9U)
#define NETC_ETH_LINK_PM1_IF_MODE_RGMII_DLY_MODE_WIDTH (1U)
#define NETC_ETH_LINK_PM1_IF_MODE_RGMII_DLY_MODE(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_RGMII_DLY_MODE_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_RGMII_DLY_MODE_MASK)

#define NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_MASK  (0x1000U)
#define NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_SHIFT (12U)
#define NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_WIDTH (1U)
#define NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_CLK_STOP_MASK)

#define NETC_ETH_LINK_PM1_IF_MODE_SSP_MASK       (0x6000U)
#define NETC_ETH_LINK_PM1_IF_MODE_SSP_SHIFT      (13U)
#define NETC_ETH_LINK_PM1_IF_MODE_SSP_WIDTH      (2U)
#define NETC_ETH_LINK_PM1_IF_MODE_SSP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PM1_IF_MODE_SSP_SHIFT)) & NETC_ETH_LINK_PM1_IF_MODE_SSP_MASK)
/*! @} */

/*! @name MAC_MERGE_MMCSR - Port MAC Merge Control and Status Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_MASK   (0x1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_SHIFT  (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_WIDTH  (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LPS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_MASK   (0x2U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_SHIFT  (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_WIDTH  (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LPE_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_MASK   (0x4U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_SHIFT  (2U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_WIDTH  (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LPA_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_MASK  (0x18U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_SHIFT (3U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_WIDTH (2U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LAFS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_MASK   (0x20U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_SHIFT  (5U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_WIDTH  (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_RPS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_MASK   (0x40U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_SHIFT  (6U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_WIDTH  (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_RPE_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_MASK   (0x80U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_SHIFT  (7U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_WIDTH  (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_RPA_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_MASK  (0x300U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_SHIFT (8U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_WIDTH (2U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_RAFS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_MASK    (0x18000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_SHIFT   (15U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_WIDTH   (2U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_ME(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_ME_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_MASK  (0x20000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_SHIFT (17U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_WIDTH (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_VDIS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_MASK  (0x1C0000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_SHIFT (18U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_WIDTH (3U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_VSTS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_MASK (0x600000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_SHIFT (21U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_WIDTH (2U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_TXSTS_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_MASK    (0x3F800000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_SHIFT   (23U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_WIDTH   (7U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_VT(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_VT_MASK)

#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_MASK (0x80000000U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_SHIFT (31U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_WIDTH (1U)
#define NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMCSR_LINK_FAIL_MASK)
/*! @} */

