zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
/*! @name MAC_MERGE_MMFAECR - Port MAC Merge Frame Assembly Error Count Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_WIDTH (32U)
#define NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFAECR_MMFAEC_MASK)
/*! @} */

/*! @name MAC_MERGE_MMFSECR - Port MAC Merge Frame SMD Error Count Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_WIDTH (32U)
#define NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFSECR_MMFSEC_MASK)
/*! @} */

/*! @name MAC_MERGE_MMFAOCR - Port MAC Merge Frame Assembly OK Count Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_WIDTH (32U)
#define NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFAOCR_MMFAOC_MASK)
/*! @} */

/*! @name MAC_MERGE_MMFCRXR - Port MAC Merge Fragment Count RX Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_WIDTH (32U)
#define NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFCRXR_MMFCRX_MASK)
/*! @} */

/*! @name MAC_MERGE_MMFCTXR - Port MAC Merge Fragment Count TX Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_MASK (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_WIDTH (32U)
#define NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX(x) (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMFCTXR_MMFCTX_MASK)
/*! @} */

/*! @name MAC_MERGE_MMHCR - Port MAC Merge Hold Count Register */
/*! @{ */

#define NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_MASK  (0xFFFFFFFFU)
#define NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_SHIFT (0U)
#define NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_WIDTH (32U)
#define NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_SHIFT)) & NETC_ETH_LINK_MAC_MERGE_MMHCR_MMHC_MASK)
/*! @} */

/*! @name PEMDIOCR - Port external MDIO configuration register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIOCR_BSY2_MASK         (0x1U)
#define NETC_ETH_LINK_PEMDIOCR_BSY2_SHIFT        (0U)
#define NETC_ETH_LINK_PEMDIOCR_BSY2_WIDTH        (1U)
#define NETC_ETH_LINK_PEMDIOCR_BSY2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_BSY2_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_BSY2_MASK)

#define NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_MASK   (0x2U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_SHIFT  (1U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_WIDTH  (1U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_MDIO_RD_ER_MASK)

#define NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_MASK    (0x1CU)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_SHIFT   (2U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_WIDTH   (3U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_MDIO_HOLD_MASK)

#define NETC_ETH_LINK_PEMDIOCR_PRE_DIS_MASK      (0x20U)
#define NETC_ETH_LINK_PEMDIOCR_PRE_DIS_SHIFT     (5U)
#define NETC_ETH_LINK_PEMDIOCR_PRE_DIS_WIDTH     (1U)
#define NETC_ETH_LINK_PEMDIOCR_PRE_DIS(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_PRE_DIS_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_PRE_DIS_MASK)

#define NETC_ETH_LINK_PEMDIOCR_ENC45_MASK        (0x40U)
#define NETC_ETH_LINK_PEMDIOCR_ENC45_SHIFT       (6U)
#define NETC_ETH_LINK_PEMDIOCR_ENC45_WIDTH       (1U)
#define NETC_ETH_LINK_PEMDIOCR_ENC45(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_ENC45_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_ENC45_MASK)

#define NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_MASK (0xFF80U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_SHIFT (7U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_WIDTH (9U)
#define NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_MDIO_CLK_DIV_MASK)

#define NETC_ETH_LINK_PEMDIOCR_WHOAMI_MASK       (0x1F0000U)
#define NETC_ETH_LINK_PEMDIOCR_WHOAMI_SHIFT      (16U)
#define NETC_ETH_LINK_PEMDIOCR_WHOAMI_WIDTH      (5U)
#define NETC_ETH_LINK_PEMDIOCR_WHOAMI(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_WHOAMI_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_WHOAMI_MASK)

#define NETC_ETH_LINK_PEMDIOCR_EHOLD_MASK        (0x400000U)
#define NETC_ETH_LINK_PEMDIOCR_EHOLD_SHIFT       (22U)
#define NETC_ETH_LINK_PEMDIOCR_EHOLD_WIDTH       (1U)
#define NETC_ETH_LINK_PEMDIOCR_EHOLD(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_EHOLD_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_EHOLD_MASK)

#define NETC_ETH_LINK_PEMDIOCR_NEG_MASK          (0x800000U)
#define NETC_ETH_LINK_PEMDIOCR_NEG_SHIFT         (23U)
#define NETC_ETH_LINK_PEMDIOCR_NEG_WIDTH         (1U)
#define NETC_ETH_LINK_PEMDIOCR_NEG(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_NEG_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_NEG_MASK)

#define NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_MASK     (0x10000000U)
#define NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_SHIFT    (28U)
#define NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_WIDTH    (1U)
#define NETC_ETH_LINK_PEMDIOCR_ADDR_ERR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_ADDR_ERR_MASK)

