zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
#define NETC_ETH_LINK_PEMDIOCR_CIM_MASK          (0x20000000U)
#define NETC_ETH_LINK_PEMDIOCR_CIM_SHIFT         (29U)
#define NETC_ETH_LINK_PEMDIOCR_CIM_WIDTH         (1U)
#define NETC_ETH_LINK_PEMDIOCR_CIM(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_CIM_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_CIM_MASK)

#define NETC_ETH_LINK_PEMDIOCR_CMP_MASK          (0x40000000U)
#define NETC_ETH_LINK_PEMDIOCR_CMP_SHIFT         (30U)
#define NETC_ETH_LINK_PEMDIOCR_CMP_WIDTH         (1U)
#define NETC_ETH_LINK_PEMDIOCR_CMP(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_CMP_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_CMP_MASK)

#define NETC_ETH_LINK_PEMDIOCR_BSY1_MASK         (0x80000000U)
#define NETC_ETH_LINK_PEMDIOCR_BSY1_SHIFT        (31U)
#define NETC_ETH_LINK_PEMDIOCR_BSY1_WIDTH        (1U)
#define NETC_ETH_LINK_PEMDIOCR_BSY1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOCR_BSY1_SHIFT)) & NETC_ETH_LINK_PEMDIOCR_BSY1_MASK)
/*! @} */

/*! @name PEMDIOICR - Port external MDIO interface control register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_MASK    (0x1FU)
#define NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_SHIFT   (0U)
#define NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_WIDTH   (5U)
#define NETC_ETH_LINK_PEMDIOICR_DEV_ADDR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_DEV_ADDR_MASK)

#define NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_MASK   (0x3E0U)
#define NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_SHIFT  (5U)
#define NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_WIDTH  (5U)
#define NETC_ETH_LINK_PEMDIOICR_PORT_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_PORT_ADDR_MASK)

#define NETC_ETH_LINK_PEMDIOICR_POST_INC_MASK    (0x4000U)
#define NETC_ETH_LINK_PEMDIOICR_POST_INC_SHIFT   (14U)
#define NETC_ETH_LINK_PEMDIOICR_POST_INC_WIDTH   (1U)
#define NETC_ETH_LINK_PEMDIOICR_POST_INC(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_POST_INC_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_POST_INC_MASK)

#define NETC_ETH_LINK_PEMDIOICR_READ_MASK        (0x8000U)
#define NETC_ETH_LINK_PEMDIOICR_READ_SHIFT       (15U)
#define NETC_ETH_LINK_PEMDIOICR_READ_WIDTH       (1U)
#define NETC_ETH_LINK_PEMDIOICR_READ(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_READ_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_READ_MASK)

#define NETC_ETH_LINK_PEMDIOICR_BSY_MASK         (0x80000000U)
#define NETC_ETH_LINK_PEMDIOICR_BSY_SHIFT        (31U)
#define NETC_ETH_LINK_PEMDIOICR_BSY_WIDTH        (1U)
#define NETC_ETH_LINK_PEMDIOICR_BSY(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOICR_BSY_SHIFT)) & NETC_ETH_LINK_PEMDIOICR_BSY_MASK)
/*! @} */

/*! @name PEMDIOIDR - Port external MDIO interface data register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_MASK   (0xFFFFU)
#define NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_SHIFT  (0U)
#define NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_WIDTH  (16U)
#define NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_SHIFT)) & NETC_ETH_LINK_PEMDIOIDR_MDIO_DATA_MASK)
/*! @} */

/*! @name PEMDIORAR - Port external MDIO register address register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIORAR_REGADDR_MASK     (0xFFFFU)
#define NETC_ETH_LINK_PEMDIORAR_REGADDR_SHIFT    (0U)
#define NETC_ETH_LINK_PEMDIORAR_REGADDR_WIDTH    (16U)
#define NETC_ETH_LINK_PEMDIORAR_REGADDR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIORAR_REGADDR_SHIFT)) & NETC_ETH_LINK_PEMDIORAR_REGADDR_MASK)
/*! @} */

/*! @name PEMDIOSR - Port external MDIO status register */
/*! @{ */

#define NETC_ETH_LINK_PEMDIOSR_BSY_MASK          (0x1U)
#define NETC_ETH_LINK_PEMDIOSR_BSY_SHIFT         (0U)
#define NETC_ETH_LINK_PEMDIOSR_BSY_WIDTH         (1U)
#define NETC_ETH_LINK_PEMDIOSR_BSY(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_BSY_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_BSY_MASK)

#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_MASK     (0x1F00U)
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_SHIFT    (8U)
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_WIDTH    (5U)
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_WHT_LIST_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_WHT_LIST_MASK)

#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_MASK (0x8000U)
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_SHIFT (15U)
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_WIDTH (1U)
#define NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_WHT_LIST_ENA_MASK)

#define NETC_ETH_LINK_PEMDIOSR_PORT_ID_MASK      (0x1F0000U)
#define NETC_ETH_LINK_PEMDIOSR_PORT_ID_SHIFT     (16U)
#define NETC_ETH_LINK_PEMDIOSR_PORT_ID_WIDTH     (5U)
#define NETC_ETH_LINK_PEMDIOSR_PORT_ID(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_PORT_ID_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_PORT_ID_MASK)

#define NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_MASK     (0x1000000U)
#define NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_SHIFT    (24U)
#define NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_WIDTH    (1U)
#define NETC_ETH_LINK_PEMDIOSR_REQ_TYPE(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_SHIFT)) & NETC_ETH_LINK_PEMDIOSR_REQ_TYPE_MASK)
/*! @} */

/*! @name PPSCR - PHY status configuration register */
/*! @{ */

#define NETC_ETH_LINK_PPSCR_BSY_MASK             (0x1U)
#define NETC_ETH_LINK_PPSCR_BSY_SHIFT            (0U)
#define NETC_ETH_LINK_PPSCR_BSY_WIDTH            (1U)
#define NETC_ETH_LINK_PPSCR_BSY(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCR_BSY_SHIFT)) & NETC_ETH_LINK_PPSCR_BSY_MASK)

#define NETC_ETH_LINK_PPSCR_MDIO_RD_ER_MASK      (0x2U)
#define NETC_ETH_LINK_PPSCR_MDIO_RD_ER_SHIFT     (1U)
#define NETC_ETH_LINK_PPSCR_MDIO_RD_ER_WIDTH     (1U)
#define NETC_ETH_LINK_PPSCR_MDIO_RD_ER(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCR_MDIO_RD_ER_SHIFT)) & NETC_ETH_LINK_PPSCR_MDIO_RD_ER_MASK)

#define NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_MASK (0xFFFF0000U)
#define NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_SHIFT (16U)
#define NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_WIDTH (16U)
#define NETC_ETH_LINK_PPSCR_STATUS_INTERVAL(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_SHIFT)) & NETC_ETH_LINK_PPSCR_STATUS_INTERVAL_MASK)
/*! @} */

