zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_ETH_LINK.h
/*! @name PPSCTRLR - Port PHY status control register */
/*! @{ */

#define NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_MASK     (0x1FU)
#define NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_SHIFT    (0U)
#define NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_WIDTH    (5U)
#define NETC_ETH_LINK_PPSCTRLR_DEV_ADDR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_SHIFT)) & NETC_ETH_LINK_PPSCTRLR_DEV_ADDR_MASK)

#define NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_MASK    (0x3E0U)
#define NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_SHIFT   (5U)
#define NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_WIDTH   (5U)
#define NETC_ETH_LINK_PPSCTRLR_PORT_ADDR(x)      (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_SHIFT)) & NETC_ETH_LINK_PPSCTRLR_PORT_ADDR_MASK)
/*! @} */

/*! @name PPSDR - Port PHY status data register */
/*! @{ */

#define NETC_ETH_LINK_PPSDR_MDIO_DATA_MASK       (0xFFFFU)
#define NETC_ETH_LINK_PPSDR_MDIO_DATA_SHIFT      (0U)
#define NETC_ETH_LINK_PPSDR_MDIO_DATA_WIDTH      (16U)
#define NETC_ETH_LINK_PPSDR_MDIO_DATA(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSDR_MDIO_DATA_SHIFT)) & NETC_ETH_LINK_PPSDR_MDIO_DATA_MASK)

#define NETC_ETH_LINK_PPSDR_CURR_CNT_MASK        (0xFFFF0000U)
#define NETC_ETH_LINK_PPSDR_CURR_CNT_SHIFT       (16U)
#define NETC_ETH_LINK_PPSDR_CURR_CNT_WIDTH       (16U)
#define NETC_ETH_LINK_PPSDR_CURR_CNT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSDR_CURR_CNT_SHIFT)) & NETC_ETH_LINK_PPSDR_CURR_CNT_MASK)
/*! @} */

/*! @name PPSRAR - Port PHY status register address register */
/*! @{ */

#define NETC_ETH_LINK_PPSRAR_REGADDR_MASK        (0xFFFFU)
#define NETC_ETH_LINK_PPSRAR_REGADDR_SHIFT       (0U)
#define NETC_ETH_LINK_PPSRAR_REGADDR_WIDTH       (16U)
#define NETC_ETH_LINK_PPSRAR_REGADDR(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSRAR_REGADDR_SHIFT)) & NETC_ETH_LINK_PPSRAR_REGADDR_MASK)
/*! @} */

/*! @name PPSER - Port PHY status event register */
/*! @{ */

#define NETC_ETH_LINK_PPSER_STATUS_EVENT_HL_MASK (0xFFFFU)
#define NETC_ETH_LINK_PPSER_STATUS_EVENT_HL_SHIFT (0U)
#define NETC_ETH_LINK_PPSER_STATUS_EVENT_HL_WIDTH (16U)
#define NETC_ETH_LINK_PPSER_STATUS_EVENT_HL(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSER_STATUS_EVENT_HL_SHIFT)) & NETC_ETH_LINK_PPSER_STATUS_EVENT_HL_MASK)

#define NETC_ETH_LINK_PPSER_STATUS_EVENT_LH_MASK (0xFFFF0000U)
#define NETC_ETH_LINK_PPSER_STATUS_EVENT_LH_SHIFT (16U)
#define NETC_ETH_LINK_PPSER_STATUS_EVENT_LH_WIDTH (16U)
#define NETC_ETH_LINK_PPSER_STATUS_EVENT_LH(x)   (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSER_STATUS_EVENT_LH_SHIFT)) & NETC_ETH_LINK_PPSER_STATUS_EVENT_LH_MASK)
/*! @} */

/*! @name PPSMR - Port PHY status mask register */
/*! @{ */

#define NETC_ETH_LINK_PPSMR_STATUS_MASK_HL_MASK  (0xFFFFU)
#define NETC_ETH_LINK_PPSMR_STATUS_MASK_HL_SHIFT (0U)
#define NETC_ETH_LINK_PPSMR_STATUS_MASK_HL_WIDTH (16U)
#define NETC_ETH_LINK_PPSMR_STATUS_MASK_HL(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSMR_STATUS_MASK_HL_SHIFT)) & NETC_ETH_LINK_PPSMR_STATUS_MASK_HL_MASK)

#define NETC_ETH_LINK_PPSMR_STATUS_MASK_LH_MASK  (0xFFFF0000U)
#define NETC_ETH_LINK_PPSMR_STATUS_MASK_LH_SHIFT (16U)
#define NETC_ETH_LINK_PPSMR_STATUS_MASK_LH_WIDTH (16U)
#define NETC_ETH_LINK_PPSMR_STATUS_MASK_LH(x)    (((uint32_t)(((uint32_t)(x)) << NETC_ETH_LINK_PPSMR_STATUS_MASK_LH_SHIFT)) & NETC_ETH_LINK_PPSMR_STATUS_MASK_LH_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group NETC_ETH_LINK_Register_Masks */

/*!
 * @}
 */ /* end of group NETC_ETH_LINK_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_NETC_ETH_LINK_H_) */
